tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1615_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1615_H_
#define _PIC16F1615_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define CCP1IF                        52
#define SSP1IF                        53
#define TXIF                          54
#define RCIF                          55
#define ADIF                          56
#define TMR1GIF                       57
#define PIR2                          58
#define CCP2IF                        59
#define TMR4IF                        60
#define TMR6IF                        61
#define BCL1IF                        62
#define C1IF                          63
#define C2IF                          64
#define OSFIF                         65
#define PIR3                          66
#define CLC1IF                        67
#define CLC2IF                        68
#define CLC3IF                        69
#define CLC4IF                        70
#define ZCDIF                         71
#define CWGIF                         72
#define PIR4                          73
#define SMT1IF                        74
#define SMT1PRAIF                     75
#define SMT1PWAIF                     76
#define SMT2IF                        77
#define SMT2PRAIF                     78
#define SMT2PWAIF                     79
#define CRCIF                         80
#define SCANIF                        81
#define PIR5                          82
#define PID1DIF                       83
#define PID1EIF                       84
#define AT1IF                         85
#define TMR5IF                        86
#define TMR5GIF                       87
#define TMR3IF                        88
#define TMR3GIF                       89
#define TMR0                          90
#define TMR1L                         91
#define TMR1H                         92
#define T1CON                         93
#define TMR1ON                        94
#define nT1SYNC                       95
#define T1CKPS0                       96
#define T1CKPS                        97
#define T1CKPS1                       98
#define TMR1CS0                       99
#define TMR1CS                        100
#define TMR1CS1                       101
#define T1GCON                        102
#define T1GSS0                        103
#define T1GSS                         104
#define T1GSS1                        105
#define T1GVAL                        106
#define T1GGO_nDONE                   107
#define T1GSPM                        108
#define T1GTM                         109
#define T1GPOL                        110
#define TMR1GE                        111
#define T2TMR                         112
#define TMR2                          113
#define T2TMR_TMR                     114
#define T2PR                          115
#define T2PR_PR                       116
#define T2CON                         117
#define T2OUTPS0                      118
#define T2CON_OUTPS0                  119
#define T2OUTPS                       120
#define T2CON_OUTPS                   121
#define T2OUTPS1                      122
#define T2CON_OUTPS1                  123
#define T2OUTPS2                      124
#define T2CON_OUTPS2                  125
#define T2OUTPS3                      126
#define T2CON_OUTPS3                  127
#define T2CKPS0                       128
#define T2CON_CKPS                    129
#define T2CKPS                        130
#define T2CON_CKPS0                   131
#define T2CKPS1                       132
#define T2CON_CKPS1                   133
#define T2CKPS2                       134
#define T2CON_CKPS2                   135
#define T2CON_ON                      136
#define TMR2ON                        137
#define T2ON                          138
#define T2HLT                         139
#define T2HLT_MODE                    140
#define T2MODE                        141
#define T2MODE0                       142
#define T2HLT_MODE0                   143
#define T2MODE1                       144
#define T2HLT_MODE1                   145
#define T2MODE2                       146
#define T2HLT_MODE2                   147
#define T2MODE3                       148
#define T2HLT_MODE3                   149
#define T2MODE4                       150
#define T2HLT_MODE4                   151
#define T2HLT_CKSYNC                  152
#define T2CKSYNC                      153
#define T2HLT_CKPOL                   154
#define T2CKPOL                       155
#define T2PSYNC                       156
#define T2HLT_PSYNC                   157
#define T2CLKCON                      158
#define T2CS                          159
#define T2CS0                         160
#define T2CLKCON_CS                   161
#define T2CLKCON_CS0                  162
#define T2CS1                         163
#define T2CLKCON_CS1                  164
#define T2CS2                         165
#define T2CLKCON_CS2                  166
#define T2CS3                         167
#define T2CLKCON_CS3                  168
#define T2RST                         169
#define T2RSEL0                       170
#define T2RST_RSEL                    171
#define T2RSEL                        172
#define T2RST_RSEL0                   173
#define T2RSEL1                       174
#define T2RST_RSEL1                   175
#define T2RST_RSEL2                   176
#define T2RSEL2                       177
#define T2RSEL3                       178
#define T2RST_RSEL3                   179
#define TRISA                         180
#define TRISA0                        181
#define TRISA1                        182
#define TRISA2                        183
#define TRISA3                        184
#define TRISA4                        185
#define TRISA5                        186
#define TRISC                         187
#define TRISC0                        188
#define TRISC1                        189
#define TRISC2                        190
#define TRISC3                        191
#define TRISC4                        192
#define TRISC5                        193
#define PIE1                          194
#define TMR1IE                        195
#define TMR2IE                        196
#define CCP1IE                        197
#define SSP1IE                        198
#define TXIE                          199
#define RCIE                          200
#define ADIE                          201
#define TMR1GIE                       202
#define PIE2                          203
#define CCP2IE                        204
#define TMR4IE                        205
#define TMR6IE                        206
#define BCL1IE                        207
#define C1IE                          208
#define C2IE                          209
#define OSCFIE                        210
#define PIE3                          211
#define CLC1IE                        212
#define CLC2IE                        213
#define CLC3IE                        214
#define CLC4IE                        215
#define ZCDIE                         216
#define CWGIE                         217
#define PIE4                          218
#define SMT1IE                        219
#define SMT1PRAIE                     220
#define SMT1PWAIE                     221
#define SMT2IE                        222
#define SMT2PRAIE                     223
#define SMT2PWAIE                     224
#define CRCIE                         225
#define SCANIE                        226
#define PIE5                          227
#define PID1DIE                       228
#define PID1EIE                       229
#define AT1IE                         230
#define TMR5IE                        231
#define TMR5GIE                       232
#define TMR3IE                        233
#define TMR3GIE                       234
#define OPTION_REG                    235
#define OPTION_REG_PS                 236
#define OPTION_REG_PS0                237
#define OPTION_REG_PS1                238
#define PS2                           239
#define PSA                           240
#define T0SE                          241
#define TMR0SE                        242
#define T0CS                          243
#define TMR0CS                        244
#define INTEDG                        245
#define nWPUEN                        246
#define PCON                          247
#define nBOR                          248
#define nPOR                          249
#define nRI                           250
#define nRMCLR                        251
#define nRWDT                         252
#define nWDTWV                        253
#define STKUNF                        254
#define STKOVF                        255
#define OSCTUNE                       256
#define TUN0                          257
#define TUN                           258
#define TUN1                          259
#define TUN2                          260
#define TUN3                          261
#define TUN4                          262
#define TUN5                          263
#define OSCCON                        264
#define SCS0                          265
#define SCS                           266
#define SCS1                          267
#define IRCF                          268
#define IRCF0                         269
#define IRCF1                         270
#define IRCF2                         271
#define IRCF3                         272
#define SPLLEN                        273
#define OSCSTAT                       274
#define HFIOFS                        275
#define LFIOFR                        276
#define MFIOFR                        277
#define HFIOFL                        278
#define HFIOFR                        279
#define OSTS                          280
#define PLLR                          281
#define ADRESL                        282
#define ADRESH                        283
#define ADCON0                        284
#define ADON                          285
#define GO_nDONE                      286
#define GO                            287
#define ADGO                          288
#define CHS0                          289
#define CHS                           290
#define CHS1                          291
#define CHS2                          292
#define CHS3                          293
#define CHS4                          294
#define ADCON1                        295
#define ADPREF0                       296
#define ADPREF                        297
#define ADPREF1                       298
#define ADCS0                         299
#define ADCS                          300
#define ADCS1                         301
#define ADCS2                         302
#define ADFM                          303
#define ADCON2                        304
#define TRIGSEL                       305
#define TRIGSEL0                      306
#define TRIGSEL1                      307
#define TRIGSEL2                      308
#define TRIGSEL3                      309
#define LATA                          310
#define LATA0                         311
#define LATA1                         312
#define LATA2                         313
#define LATA3                         314
#define LATA4                         315
#define LATA5                         316
#define LATC                          317
#define LATC0                         318
#define LATC1                         319
#define LATC2                         320
#define LATC3                         321
#define LATC4                         322
#define LATC5                         323
#define CM1CON0                       324
#define C1SYNC                        325
#define C1HYS                         326
#define C1SP                          327
#define C1POL                         328
#define C1OUT                         329
#define C1ON                          330
#define CM1CON1                       331
#define C1NCH0                        332
#define C1NCH                         333
#define C1NCH1                        334
#define C1NCH2                        335
#define C1PCH                         336
#define C1PCH0                        337
#define C1PCH1                        338
#define C1INTN                        339
#define C1INTP                        340
#define CM2CON0                       341
#define C2SYNC                        342
#define C2HYS                         343
#define C2SP                          344
#define C2POL                         345
#define C2OUT                         346
#define C2ON                          347
#define CM2CON1                       348
#define C2NCH0                        349
#define C2NCH                         350
#define C2NCH1                        351
#define C2NCH2                        352
#define C2PCH                         353
#define C2PCH0                        354
#define C2PCH1                        355
#define C2INTN                        356
#define C2INTP                        357
#define CMOUT                         358
#define MC1OUT                        359
#define MC2OUT                        360
#define BORCON                        361
#define BORRDY                        362
#define BORFS                         363
#define SBOREN                        364
#define FVRCON                        365
#define ADFVR0                        366
#define ADFVR                         367
#define ADFVR1                        368
#define CDAFVR                        369
#define CDAFVR0                       370
#define CDAFVR1                       371
#define TSRNG                         372
#define TSEN                          373
#define FVRRDY                        374
#define FVREN                         375
#define DAC1CON0                      376
#define DAC1PSS                       377
#define D1PSS0                        378
#define D1PSS1                        379
#define DAC1OE                        380
#define DAC1EN                        381
#define DAC1CON1                      382
#define DAC1R                         383
#define DAC1R0                        384
#define DAC1R1                        385
#define DAC1R2                        386
#define DAC1R3                        387
#define DAC1R4                        388
#define DAC1R5                        389
#define DAC1R6                        390
#define DAC1R7                        391
#define ZCD1CON                       392
#define ZCD1INTN                      393
#define ZCD1INTP                      394
#define ZCD1POL                       395
#define ZCD1OUT                       396
#define ZCD1EN                        397
#define ANSA0                         398
#define ANSELA                        399
#define ANSA1                         400
#define ANSA2                         401
#define ANSA4                         402
#define ANSC0                         403
#define ANSELC                        404
#define ANSC1                         405
#define ANSC2                         406
#define ANSC3                         407
#define PMADRL                        408
#define PMADRH                        409
#define PMDATL                        410
#define PMDATH                        411
#define PMCON1                        412
#define RD                            413
#define WR                            414
#define WREN                          415
#define WRERR                         416
#define FREE                          417
#define LWLO                          418
#define CFGS                          419
#define PMCON2                        420
#define VREGCON                       421
#define VREGPM0                       422
#define VREGPM                        423
#define VREGPM1                       424
#define RC1REG                        425
#define TX1REG                        426
#define SP1BRGL                       427
#define SP1BRGH                       428
#define RC1STA                        429
#define RX9D                          430
#define OERR                          431
#define FERR                          432
#define ADDEN                         433
#define CREN                          434
#define SREN                          435
#define RX9                           436
#define SPEN                          437
#define TX1STA                        438
#define TX9D                          439
#define TRMT                          440
#define BRGH                          441
#define SENDB                         442
#define SYNC                          443
#define TXEN                          444
#define TX9                           445
#define CSRC                          446
#define BAUD1CON                      447
#define ABDEN                         448
#define WUE                           449
#define BRG16                         450
#define SCKP                          451
#define RCIDL                         452
#define ABDOVF                        453
#define WPUA                          454
#define WPUA0                         455
#define WPUA_WPUA                     456
#define WPUA1                         457
#define WPUA2                         458
#define WPUA3                         459
#define WPUA4                         460
#define WPUA5                         461
#define WPUC                          462
#define WPUC0                         463
#define WPUC_WPUA                     464
#define WPUC1                         465
#define WPUC2                         466
#define WPUC3                         467
#define WPUC4                         468
#define WPUC5                         469
#define SSP1BUF                       470
#define BUF                           471
#define BUF0                          472
#define SSP1BUF0                      473
#define BUF1                          474
#define SSP1BUF1                      475
#define BUF2                          476
#define SSP1BUF2                      477
#define BUF3                          478
#define SSP1BUF3                      479
#define BUF4                          480
#define SSP1BUF4                      481
#define BUF5                          482
#define SSP1BUF5                      483
#define BUF6                          484
#define SSP1BUF6                      485
#define BUF7                          486
#define SSP1BUF7                      487
#define ADD0                          488
#define ADD                           489
#define SSP1ADD0                      490
#define SSP1ADD                       491
#define ADD1                          492
#define SSP1ADD1                      493
#define ADD2                          494
#define SSP1ADD2                      495
#define ADD3                          496
#define SSP1ADD3                      497
#define ADD4                          498
#define SSP1ADD4                      499
#define ADD5                          500
#define SSP1ADD5                      501
#define ADD6                          502
#define SSP1ADD6                      503
#define ADD7                          504
#define SSP1ADD7                      505
#define SSP1MSK0                      506
#define SSP1MSK                       507
#define MSK0                          508
#define MSK                           509
#define SSP1MSK1                      510
#define MSK1                          511
#define SSP1MSK2                      512
#define MSK2                          513
#define SSP1MSK3                      514
#define MSK3                          515
#define SSP1MSK4                      516
#define MSK4                          517
#define SSP1MSK5                      518
#define MSK5                          519
#define SSP1MSK6                      520
#define MSK6                          521
