tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1615_tdd.h
#define SSP1MSK7                      522
#define MSK7                          523
#define SSP1STAT                      524
#define BF                            525
#define UA                            526
#define R_nW                          527
#define S                             528
#define P                             529
#define D_nA                          530
#define CKE                           531
#define SMP                           532
#define SSP1CON1                      533
#define SSPM0                         534
#define SSPM                          535
#define SSPM1                         536
#define SSPM2                         537
#define SSPM3                         538
#define CKP                           539
#define SSPEN                         540
#define SSPOV                         541
#define WCOL                          542
#define SSP1CON2                      543
#define SSP1CON2_SEN                  544
#define RSEN                          545
#define PEN                           546
#define RCEN                          547
#define ACKEN                         548
#define ACKDT                         549
#define ACKSTAT                       550
#define GCEN                          551
#define SSP1CON3                      552
#define DHEN                          553
#define AHEN                          554
#define SBCDE                         555
#define SDAHT                         556
#define BOEN                          557
#define SCIE                          558
#define PCIE                          559
#define ACKTIM                        560
#define ODCONA                        561
#define ODA0                          562
#define ODA1                          563
#define ODA2                          564
#define ODA4                          565
#define ODA5                          566
#define ODCONC                        567
#define ODC0                          568
#define ODC1                          569
#define ODC2                          570
#define ODC3                          571
#define ODC4                          572
#define ODC5                          573
#define CCPR1L                        574
#define CCPR1L_RL                     575
#define CCPR1H                        576
#define CCPR1H_RH                     577
#define CCP1CON                       578
#define CCP1MODE0                     579
#define CCP1CON_MODE0                 580
#define CCP1CON_MODE                  581
#define CCP1MODE                      582
#define CCP1MODE1                     583
#define CCP1CON_MODE1                 584
#define CCP1MODE2                     585
#define CCP1CON_MODE2                 586
#define CCP1MODE3                     587
#define CCP1CON_MODE3                 588
#define CCP1CON_FMT                   589
#define CCP1FMT                       590
#define CCP1CON_OUT                   591
#define CCP1OUT                       592
#define CCP1EN                        593
#define CCP1CON_EN                    594
#define CCP1CAP                       595
#define CCP1CTS0                      596
#define CCP1CAP_CTS                   597
#define CCP1CAP_CTS0                  598
#define CCP1CTS                       599
#define CCP1CTS1                      600
#define CCP1CAP_CTS1                  601
#define CCP1CTS2                      602
#define CCP1CAP_CTS2                  603
#define CCPR2L                        604
#define CCPR2L_RL                     605
#define CCPR2H                        606
#define CCPR2H_RH                     607
#define CCP2CON                       608
#define CCP2MODE                      609
#define CCP2MODE0                     610
#define CCP2CON_MODE0                 611
#define CCP2CON_MODE                  612
#define CCP2MODE1                     613
#define CCP2CON_MODE1                 614
#define CCP2MODE2                     615
#define CCP2CON_MODE2                 616
#define CCP2MODE3                     617
#define CCP2CON_MODE3                 618
#define CCP2FMT                       619
#define CCP2CON_FMT                   620
#define CCP2OUT                       621
#define CCP2CON_OUT                   622
#define CCP2EN                        623
#define CCP2CON_EN                    624
#define CCP2CAP                       625
#define CCP2CAP_CTS                   626
#define CCP2CAP_CTS0                  627
#define CCP2CTS                       628
#define CCP2CTS0                      629
#define CCP2CAP_CTS1                  630
#define CCP2CTS1                      631
#define CCP2CAP_CTS2                  632
#define CCP2CTS2                      633
#define CCPTMRS                       634
#define CCP1TSEL0                     635
#define CCP1TSEL                      636
#define CCP1TSEL1                     637
#define CCP2TSEL0                     638
#define CCP2TSEL                      639
#define CCP2TSEL1                     640
#define P3TSEL                        641
#define P3TSEL0                       642
#define P3TSEL1                       643
#define P4TSEL0                       644
#define P4TSEL                        645
#define P4TSEL1                       646
#define SLRCONA                       647
#define SLRA0                         648
#define SLRA1                         649
#define SLRA2                         650
#define SLRA4                         651
#define SLRA5                         652
#define SLRCONC                       653
#define SLRC0                         654
#define SLRC1                         655
#define SLRC2                         656
#define SLRC3                         657
#define SLRC4                         658
#define SLRC5                         659
#define INLVLA                        660
#define INLVLA0                       661
#define INLVLA1                       662
#define INLVLA2                       663
#define INLVLA3                       664
#define INLVLA4                       665
#define INLVLA5                       666
#define INLVLC                        667
#define INLVLC0                       668
#define INLVLC1                       669
#define INLVLC2                       670
#define INLVLC3                       671
#define INLVLC4                       672
#define INLVLC5                       673
#define IOCAP                         674
#define IOCAP0                        675
#define IOCAP1                        676
#define IOCAP2                        677
#define IOCAP3                        678
#define IOCAP4                        679
#define IOCAP5                        680
#define IOCAN0                        681
#define IOCAN                         682
#define IOCAN1                        683
#define IOCAN2                        684
#define IOCAN3                        685
#define IOCAN4                        686
#define IOCAN5                        687
#define IOCAF0                        688
#define IOCAF                         689
#define IOCAF1                        690
#define IOCAF2                        691
#define IOCAF3                        692
#define IOCAF4                        693
#define IOCAF5                        694
#define IOCCP                         695
#define IOCCP0                        696
#define IOCCP1                        697
#define IOCCP2                        698
#define IOCCP3                        699
#define IOCCP4                        700
#define IOCCP5                        701
#define IOCCP6                        702
#define IOCCP7                        703
#define IOCCN                         704
#define IOCCN0                        705
#define IOCCN1                        706
#define IOCCN2                        707
#define IOCCN3                        708
#define IOCCN4                        709
#define IOCCN5                        710
#define IOCCN6                        711
#define IOCCN7                        712
#define IOCCF                         713
#define IOCCF0                        714
#define IOCCF1                        715
#define IOCCF2                        716
#define IOCCF3                        717
#define IOCCF4                        718
#define IOCCF5                        719
#define IOCCF6                        720
#define IOCCF7                        721
#define HIDRVC                        722
#define HIDC4                         723
#define HIDC5                         724
#define T4TMR                         725
#define TMR4                          726
#define T4TMR_TMR                     727
#define T4PR_PR                       728
#define T4PR                          729
#define T4CON                         730
#define T4OUTPS0                      731
#define T4CON_OUTPS                   732
#define T4OUTPS                       733
#define T4CON_OUTPS0                  734
#define T4OUTPS1                      735
#define T4CON_OUTPS1                  736
#define T4CON_OUTPS2                  737
#define T4OUTPS2                      738
#define T4OUTPS3                      739
#define T4CON_OUTPS3                  740
#define T4CON_CKPS0                   741
#define T4CKPS0                       742
#define T4CON_CKPS                    743
#define T4CKPS                        744
#define T4CKPS1                       745
#define T4CON_CKPS1                   746
#define T4CKPS2                       747
#define T4CON_CKPS2                   748
#define T4ON                          749
#define T4CON_ON                      750
#define TMR4ON                        751
#define T4HLT                         752
#define T4MODE                        753
#define T4HLT_MODE                    754
#define T4HLT_MODE0                   755
#define T4MODE0                       756
#define T4HLT_MODE1                   757
#define T4MODE1                       758
#define T4HLT_MODE2                   759
#define T4MODE2                       760
#define T4HLT_MODE3                   761
#define T4MODE3                       762
#define T4HLT_MODE4                   763
#define T4MODE4                       764
#define T4CKSYNC                      765
#define T4HLT_CKSYNC                  766
#define T4HLT_CKPOL                   767
#define T4CKPOL                       768
#define T4PSYNC                       769
#define T4HLT_PSYNC                   770
#define T4CLKCON                      771
#define T4CS                          772
#define T4CLKCON_CS                   773
#define T4CS0                         774
#define T4CLKCON_CS0                  775
#define T4CS1                         776
#define T4CLKCON_CS1                  777
#define T4CS2                         778
#define T4CLKCON_CS2                  779
#define T4CS3                         780
#define T4CLKCON_CS3                  781
#define T4RST                         782
#define T4RSEL0                       783
#define T4RSEL                        784
#define T4RST_RSEL                    785
#define T4RST_RSEL0                   786
#define T4RSEL1                       787
#define T4RST_RSEL1                   788
#define T4RSEL2                       789
#define T4RST_RSEL2                   790
#define T4RSEL3                       791
#define T4RST_RSEL3                   792
#define T6TMR                         793
#define TMR6                          794
#define T6TMR_TMR                     795
#define T6PR_PR                       796
#define T6PR                          797
#define T6CON                         798
#define T6CON_OUTPS0                  799
#define T6OUTPS                       800
#define T6CON_OUTPS                   801
#define T6OUTPS0                      802
#define T6CON_OUTPS1                  803
#define T6OUTPS1                      804
#define T6CON_OUTPS2                  805
#define T6OUTPS2                      806
#define T6CON_OUTPS3                  807
#define T6OUTPS3                      808
#define T6CON_CKPS0                   809
#define T6CKPS                        810
#define T6CKPS0                       811
#define T6CON_CKPS                    812
#define T6CON_CKPS1                   813
#define T6CKPS1                       814
#define T6CON_CKPS2                   815
#define T6CKPS2                       816
#define TMR6ON                        817
#define T6ON                          818
#define T6CON_ON                      819
#define T6HLT                         820
#define T6MODE0                       821
#define T6HLT_MODE0                   822
#define T6HLT_MODE                    823
#define T6MODE                        824
#define T6HLT_MODE1                   825
#define T6MODE1                       826
#define T6HLT_MODE2                   827
#define T6MODE2                       828
#define T6HLT_MODE3                   829
#define T6MODE3                       830
#define T6MODE4                       831
#define T6HLT_MODE4                   832
#define T6CKSYNC                      833
#define T6HLT_CKSYNC                  834
#define T6CKPOL                       835
#define T6HLT_CKPOL                   836
#define T6PSYNC                       837
#define T6HLT_PSYNC                   838
#define T6CLKCON                      839
#define T6CS                          840
#define T6CLKCON_CS                   841
#define T6CLKCON_CS0                  842
#define T6CS0                         843
#define T6CLKCON_CS1                  844
#define T6CS1                         845
#define T6CLKCON_CS2                  846
#define T6CS2                         847
#define T6CLKCON_CS3                  848
#define T6CS3                         849
#define T6RST                         850
#define T6RST_RSEL                    851
#define T6RST_RSEL0                   852
#define T6RSEL                        853
#define T6RSEL0                       854
#define T6RST_RSEL1                   855
#define T6RSEL1                       856
#define T6RSEL2                       857
#define T6RST_RSEL2                   858
#define T6RST_RSEL3                   859
#define T6RSEL3                       860
#define TMR3L                         861
#define TMR3H                         862
#define T3CON                         863
#define TMR3ON                        864
#define T3SYNC                        865
#define T3CKPS                        866
#define T3CKPS0                       867
#define T3CKPS1                       868
#define TMR3CS0                       869
#define TMR3CS                        870
#define TMR3CS1                       871
#define T3GCON                        872
#define T3GSS0                        873
#define T3GSS                         874
#define T3GSS1                        875
#define T3GVAL                        876
#define T3GGO_nDONE                   877
#define T3GSPM                        878
#define T3GTM                         879
#define T3GPOL                        880
#define TMR3GE                        881
#define TMR5L                         882
#define TMR5H                         883
#define T5CON                         884
#define TMR5ON                        885
#define T5SYNC                        886
#define T5CKPS                        887
#define T5CKPS0                       888
#define T5CKPS1                       889
#define TMR5CS0                       890
#define TMR5CS                        891
#define TMR5CS1                       892
#define T5GCON                        893
#define T5GSS                         894
#define T5GSS0                        895
#define T5GSS1                        896
#define T5GVAL                        897
#define T5GGO_nDONE                   898
#define T5GSPM                        899
#define T5GTM                         900
#define T5GPOL                        901
#define TMR5GE                        902
#define PID1SETL                      903
#define PID1SET0                      904
#define SET0                          905
#define PID1SET1                      906
#define SET1                          907
#define SET2                          908
#define PID1SET2                      909
#define SET3                          910
#define PID1SET3                      911
#define SET4                          912
#define PID1SET4                      913
#define SET5                          914
#define PID1SET5                      915
#define SET6                          916
#define PID1SET6                      917
#define SET7                          918
#define PID1SET7                      919
#define PID1SETH                      920
#define SET8                          921
#define PID1SET8                      922
#define SET9                          923
#define PID1SET9                      924
#define SET10                         925
#define PID1SET10                     926
#define SET11                         927
#define PID1SET11                     928
#define SET12                         929
#define PID1SET12                     930
#define SET13                         931
#define PID1SET13                     932
#define SET14                         933
#define PID1SET14                     934
#define SET15                         935
#define PID1SET15                     936
#define PID1INL                       937
#define IN0                           938
#define PID1IN0                       939
#define IN1                           940
#define PID1IN1                       941
#define IN2                           942
#define PID1IN2                       943
#define IN3                           944
#define PID1IN3                       945
#define IN4                           946
#define PID1IN4                       947
#define IN5                           948
#define PID1IN5                       949
#define IN6                           950
#define PID1IN6                       951
#define IN7                           952
#define PID1IN7                       953
#define PID1INH                       954
#define IN8                           955
#define PID1IN8                       956
#define IN9                           957
#define PID1IN9                       958
#define PID1IN10                      959
#define IN10                          960
#define PID1IN11                      961
#define IN11                          962
#define PID1IN12                      963
#define IN12                          964
#define PID1IN13                      965
#define IN13                          966
#define PID1IN14                      967
#define IN14                          968
#define IN15                          969
#define PID1IN15                      970
#define PID1K1L                       971
#define K10                           972
#define PID1K10                       973
#define K11                           974
#define PID1K11                       975
#define K12                           976
#define PID1K12                       977
#define K13                           978
#define PID1K13                       979
#define K14                           980
#define PID1K14                       981
#define K15                           982
#define PID1K15                       983
#define K16                           984
#define PID1K16                       985
#define K17                           986
#define PID1K17                       987
#define PID1K1H                       988
#define K18                           989
#define PID1K18                       990
#define K19                           991
#define PID1K19                       992
#define PID1K110                      993
#define K110                          994
#define PID1K111                      995
#define K111                          996
#define PID1K112                      997
#define K112                          998
#define PID1K113                      999
#define K113                          1000
#define PID1K114                      1001
#define K114                          1002
#define PID1K115                      1003
#define K115                          1004
#define PID1K2L                       1005
#define K20                           1006
#define PID1K20                       1007
#define K21                           1008
#define PID1K21                       1009
#define K22                           1010
#define PID1K22                       1011
#define K23                           1012
#define PID1K23                       1013
#define K24                           1014
#define PID1K24                       1015
#define K25                           1016
#define PID1K25                       1017
#define K26                           1018
#define PID1K26                       1019
#define K27                           1020
#define PID1K27                       1021
#define PID1K2H                       1022
#define K28                           1023
#define PID1K28                       1024
#define K29                           1025
#define PID1K29                       1026
#define PID1K210                      1027
#define K210                          1028
#define PID1K211                      1029
#define K211                          1030
#define PID1K212                      1031
#define K212                          1032
#define PID1K213                      1033
#define K213                          1034
#define PID1K214                      1035
#define K214                          1036
#define PID1K215                      1037
#define K215                          1038
#define PID1K3L                       1039
#define K30                           1040
#define PID1K30                       1041
#define K31                           1042
#define PID1K31                       1043
#define K32                           1044
#define PID1K32                       1045
#define K33                           1046
#define PID1K33                       1047
#define K34                           1048
#define PID1K34                       1049
#define K35                           1050
#define PID1K35                       1051
#define K36                           1052
#define PID1K36                       1053
#define K37                           1054
#define PID1K37                       1055
#define PID1K3H                       1056
#define K38                           1057
#define PID1K38                       1058
#define PID1K39                       1059
#define K39                           1060
#define K310                          1061
#define PID1K310                      1062
#define K311                          1063
#define PID1K311                      1064
#define K312                          1065
#define PID1K312                      1066
#define K313                          1067
#define PID1K313                      1068
#define K314                          1069
#define PID1K314                      1070
#define K315                          1071
#define PID1K315                      1072
#define PID1OUTLL                     1073
#define OUT0                          1074
#define PID1OUT0                      1075
#define OUT1                          1076
#define PID1OUT1                      1077
#define OUT2                          1078
#define PID1OUT2                      1079
#define OUT3                          1080
#define PID1OUT3                      1081
#define OUT4                          1082
#define PID1OUT4                      1083
#define OUT5                          1084
#define PID1OUT5                      1085
#define OUT6                          1086
#define PID1OUT6                      1087
#define OUT7                          1088
#define PID1OUT7                      1089
#define PID1OUTLH                     1090
