tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1615_tdd.h
#define OUT8                          1091
#define PID1OUT8                      1092
#define OUT9                          1093
#define PID1OUT9                      1094
#define PID1OUT10                     1095
#define OUT10                         1096
#define PID1OUT11                     1097
#define OUT11                         1098
#define OUT12                         1099
#define PID1OUT12                     1100
#define OUT13                         1101
#define PID1OUT13                     1102
#define PID1OUT14                     1103
#define OUT14                         1104
#define PID1OUT15                     1105
#define OUT15                         1106
#define PID1OUTHL                     1107
#define PID1OUT16                     1108
#define OUT16                         1109
#define PID1OUT17                     1110
#define OUT17                         1111
#define OUT18                         1112
#define PID1OUT18                     1113
#define OUT19                         1114
#define PID1OUT19                     1115
#define OUT20                         1116
#define PID1OUT20                     1117
#define OUT21                         1118
#define PID1OUT21                     1119
#define OUT22                         1120
#define PID1OUT22                     1121
#define OUT23                         1122
#define PID1OUT23                     1123
#define PID1OUTHH                     1124
#define OUT24                         1125
#define PID1OUT24                     1126
#define OUT25                         1127
#define PID1OUT25                     1128
#define OUT26                         1129
#define PID1OUT26                     1130
#define OUT27                         1131
#define PID1OUT27                     1132
#define OUT28                         1133
#define PID1OUT28                     1134
#define OUT29                         1135
#define PID1OUT29                     1136
#define PID1OUT30                     1137
#define OUT30                         1138
#define OUT31                         1139
#define PID1OUT31                     1140
#define PID1OUTU                      1141
#define OUT32                         1142
#define PID1OUT32                     1143
#define OUT33                         1144
#define PID1OUT33                     1145
#define OUT34                         1146
#define PID1OUT34                     1147
#define OUT35                         1148
#define PID1OUT35                     1149
#define PID1Z1L                       1150
#define PID1Z10                       1151
#define Z10                           1152
#define PID1Z11                       1153
#define Z11                           1154
#define PID1Z12                       1155
#define Z12                           1156
#define PID1Z13                       1157
#define Z13                           1158
#define PID1Z14                       1159
#define Z14                           1160
#define PID1Z15                       1161
#define Z15                           1162
#define PID1Z16                       1163
#define Z16                           1164
#define PID1Z17                       1165
#define Z17                           1166
#define PID1Z1H                       1167
#define Z18                           1168
#define PID1Z18                       1169
#define Z19                           1170
#define PID1Z19                       1171
#define Z110                          1172
#define PID1Z110                      1173
#define Z111                          1174
#define PID1Z111                      1175
#define Z112                          1176
#define PID1Z112                      1177
#define Z113                          1178
#define PID1Z113                      1179
#define Z114                          1180
#define PID1Z114                      1181
#define Z115                          1182
#define PID1Z115                      1183
#define PID1Z1U                       1184
#define Z116                          1185
#define PID1Z116                      1186
#define PID1Z2L                       1187
#define Z20                           1188
#define PID1Z20                       1189
#define Z21                           1190
#define PID1Z21                       1191
#define Z22                           1192
#define PID1Z22                       1193
#define Z23                           1194
#define PID1Z23                       1195
#define Z24                           1196
#define PID1Z24                       1197
#define Z25                           1198
#define PID1Z25                       1199
#define Z26                           1200
#define PID1Z26                       1201
#define Z27                           1202
#define PID1Z27                       1203
#define PID1Z2H                       1204
#define Z28                           1205
#define PID1Z28                       1206
#define Z29                           1207
#define PID1Z29                       1208
#define PID1Z210                      1209
#define Z210                          1210
#define PID1Z211                      1211
#define Z211                          1212
#define PID1Z212                      1213
#define Z212                          1214
#define PID1Z213                      1215
#define Z213                          1216
#define PID1Z214                      1217
#define Z214                          1218
#define PID1Z215                      1219
#define Z215                          1220
#define PID1Z2U                       1221
#define PID1Z216                      1222
#define Z216                          1223
#define PID1ACCLL                     1224
#define PID1ACCLL_ACC0                1225
#define PID1ACC0                      1226
#define PID1ACCLL_ACC1                1227
#define PID1ACC1                      1228
#define PID1ACCLL_ACC2                1229
#define PID1ACC2                      1230
#define PID1ACCLL_ACC3                1231
#define PID1ACC3                      1232
#define PID1ACCLL_ACC4                1233
#define PID1ACC4                      1234
#define PID1ACCLL_ACC5                1235
#define PID1ACC5                      1236
#define PID1ACCLL_ACC6                1237
#define PID1ACC6                      1238
#define PID1ACCLL_ACC7                1239
#define PID1ACC7                      1240
#define PID1ACCLH                     1241
#define PID1ACCLH_ACC8                1242
#define PID1ACC8                      1243
#define PID1ACCLH_ACC9                1244
#define PID1ACC9                      1245
#define PID1ACC10                     1246
#define PID1ACCLH_ACC10               1247
#define PID1ACC11                     1248
#define PID1ACCLH_ACC11               1249
#define PID1ACC12                     1250
#define PID1ACCLH_ACC12               1251
#define PID1ACC13                     1252
#define PID1ACCLH_ACC13               1253
#define PID1ACC14                     1254
#define PID1ACCLH_ACC14               1255
#define PID1ACC15                     1256
#define PID1ACCLH_ACC15               1257
#define PID1ACCHL                     1258
#define PID1ACC16                     1259
#define ACC16                         1260
#define PID1ACC17                     1261
#define ACC17                         1262
#define PID1ACC18                     1263
#define ACC18                         1264
#define PID1ACC19                     1265
#define ACC19                         1266
#define ACC20                         1267
#define PID1ACC20                     1268
#define ACC21                         1269
#define PID1ACC21                     1270
#define ACC22                         1271
#define PID1ACC22                     1272
#define ACC23                         1273
#define PID1ACC23                     1274
#define PID1ACCHH                     1275
#define ACC24                         1276
#define PID1ACC24                     1277
#define ACC25                         1278
#define PID1ACC25                     1279
#define ACC26                         1280
#define PID1ACC26                     1281
#define ACC27                         1282
#define PID1ACC27                     1283
#define ACC28                         1284
#define PID1ACC28                     1285
#define ACC29                         1286
#define PID1ACC29                     1287
#define PID1ACC30                     1288
#define ACC30                         1289
#define ACC31                         1290
#define PID1ACC31                     1291
#define PID1ACCU                      1292
#define ACC32                         1293
#define PID1ACC32                     1294
#define ACC33                         1295
#define PID1ACC33                     1296
#define PID1ACC34                     1297
#define ACC34                         1298
#define PID1CON                       1299
#define PID1CON_MODE0                 1300
#define PID1MODE0                     1301
#define PID1CON_MODE                  1302
#define PID1MODE                      1303
#define PID1CON_MODE1                 1304
#define PID1MODE1                     1305
#define PID1CON_MODE2                 1306
#define PID1MODE2                     1307
#define PID1CON_BUSY                  1308
#define PID1BUSY                      1309
#define PID1EN                        1310
#define PID1CON_EN                    1311
#define PWM3DCL                       1312
#define PWM3DC0                       1313
#define PWM3DCL_PWMPW0                1314
#define PWM3DCL_DC0                   1315
#define PWM3DCL_DC                    1316
#define PWM3DC1                       1317
#define PWM3DCL_PWMPW1                1318
#define PWM3DCL_DC1                   1319
#define PWM3DCH                       1320
#define PWM3DC2                       1321
#define PWM3DCH_DC2                   1322
#define PWM3DCH_DC                    1323
#define PWM3DCH_PWMPW2                1324
#define PWM3DC3                       1325
#define PWM3DCH_DC3                   1326
#define PWM3DCH_PWMPW3                1327
#define PWM3DC4                       1328
#define PWM3DCH_DC4                   1329
#define PWM3DCH_PWMPW4                1330
#define PWM3DC5                       1331
#define PWM3DCH_DC5                   1332
#define PWM3DCH_PWMPW5                1333
#define PWM3DC6                       1334
#define PWM3DCH_DC6                   1335
#define PWM3DCH_PWMPW6                1336
#define PWM3DC7                       1337
#define PWM3DCH_DC7                   1338
#define PWM3DCH_PWMPW7                1339
#define PWM3DC8                       1340
#define PWM3DCH_DC8                   1341
#define PWM3DCH_PWMPW8                1342
#define PWM3DC9                       1343
#define PWM3DCH_DC9                   1344
#define PWM3DCH_PWMPW9                1345
#define PWM3CON                       1346
#define PWM3CON_POL                   1347
#define PWM3POL                       1348
#define PWM3CON_OUT                   1349
#define PWM3OUT                       1350
#define PWM3EN                        1351
#define PWM3CON_EN                    1352
#define PWM4DCL                       1353
#define PWM4DCL_PWMPW0                1354
#define PWM4DCL_DC                    1355
#define PWM4DC0                       1356
#define PWM4DCL_DC0                   1357
#define PWM4DCL_PWMPW1                1358
#define PWM4DC1                       1359
#define PWM4DCL_DC1                   1360
#define PWM4DCH                       1361
#define PWM4DCH_PWMPW2                1362
#define PWM4DCH_DC                    1363
#define PWM4DC2                       1364
#define PWM4DCH_DC2                   1365
#define PWM4DCH_PWMPW3                1366
#define PWM4DC3                       1367
#define PWM4DCH_DC3                   1368
#define PWM4DCH_PWMPW4                1369
#define PWM4DC4                       1370
#define PWM4DCH_DC4                   1371
#define PWM4DCH_PWMPW5                1372
#define PWM4DC5                       1373
#define PWM4DCH_DC5                   1374
#define PWM4DCH_PWMPW6                1375
#define PWM4DC6                       1376
#define PWM4DCH_DC6                   1377
#define PWM4DCH_PWMPW7                1378
#define PWM4DC7                       1379
#define PWM4DCH_DC7                   1380
#define PWM4DCH_PWMPW8                1381
#define PWM4DC8                       1382
#define PWM4DCH_DC8                   1383
#define PWM4DCH_PWMPW9                1384
#define PWM4DC9                       1385
#define PWM4DCH_DC9                   1386
#define PWM4CON                       1387
#define PWM4POL                       1388
#define PWM4CON_POL                   1389
#define PWM4CON_OUT                   1390
#define PWM4OUT                       1391
#define PWM4EN                        1392
#define PWM4CON_EN                    1393
#define CWG1DBR0                      1394
#define CWG1DBR                       1395
#define DBR                           1396
#define DBR0                          1397
#define CWG1DBR1                      1398
#define DBR1                          1399
#define CWG1DBR2                      1400
#define DBR2                          1401
#define CWG1DBR3                      1402
#define DBR3                          1403
#define CWG1DBR4                      1404
#define DBR4                          1405
#define CWG1DBR5                      1406
#define DBR5                          1407
#define CWG1DBF                       1408
#define CWG1DBF0                      1409
#define DBF                           1410
#define DBF0                          1411
#define CWG1DBF1                      1412
#define DBF1                          1413
#define CWG1DBF2                      1414
#define DBF2                          1415
#define CWG1DBF3                      1416
#define DBF3                          1417
#define CWG1DBF4                      1418
#define DBF4                          1419
#define DBF5                          1420
#define CWG1DBF5                      1421
#define CWG1AS0                       1422
#define CWG1LSAC                      1423
#define LSAC                          1424
#define LSAC0                         1425
#define CWG1LSAC0                     1426
#define LSAC1                         1427
#define CWG1LSAC1                     1428
#define LSBD0                         1429
#define CWG1LSBD0                     1430
#define LSBD                          1431
#define CWG1LSBD                      1432
#define LSBD1                         1433
#define CWG1LSBD1                     1434
#define CWG1REN                       1435
#define REN                           1436
#define CWG1SHUTDOWN                  1437
#define SHUTDOWN                      1438
#define CWG1AS1                       1439
#define INAS                          1440
#define CWG1INAS                      1441
#define C1AS                          1442
#define CWG1C1AS                      1443
#define C2AS                          1444
#define CWG1C2AS                      1445
#define TMR2AS                        1446
#define CWG1TMR2AS                    1447
#define CWG1TMR4AS                    1448
#define TMR4AS                        1449
#define CWG1TMR6AS                    1450
#define TMR6AS                        1451
#define CWG1OCON0                     1452
#define CWG1STRA                      1453
#define STRA                          1454
#define STRB                          1455
#define CWG1STRB                      1456
#define CWG1STRC                      1457
#define STRC                          1458
#define CWG1STRD                      1459
#define STRD                          1460
#define OVRA                          1461
#define CWG1OVRA                      1462
#define CWG1OVRB                      1463
#define OVRB                          1464
#define OVRC                          1465
#define CWG1OVRC                      1466
#define OVRD                          1467
#define CWG1OVRD                      1468
#define CWG1CON0                      1469
#define CWG1MODE0                     1470
#define CWG1CON0_MODE0                1471
#define CWG1MODE                      1472
#define CWG1CON0_MODE                 1473
#define CWG1MODE1                     1474
#define CWG1CON0_MODE1                1475
#define CWG1MODE2                     1476
#define CWG1CON0_MODE2                1477
#define LD                            1478
#define CWG1LD                        1479
#define CWG1CON0_EN                   1480
#define CWG1EN                        1481
#define G1EN                          1482
#define CWG1CON1                      1483
#define CWG1POLA                      1484
#define POLA                          1485
#define CWG1POLB                      1486
#define POLB                          1487
#define CWG1POLC                      1488
#define POLC                          1489
#define CWG1POLD                      1490
#define POLD                          1491
#define IN                            1492
#define CWG1IN                        1493
#define CWG1CLKCON                    1494
#define CWG1CLKCON_CS                 1495
#define CWG1CS                        1496
#define CWG1ISM                       1497
#define CWG1IS                        1498
#define IS                            1499
#define IS0                           1500
#define CWG1IS0                       1501
#define CWG1IS1                       1502
#define IS1                           1503
#define IS2                           1504
#define CWG1IS2                       1505
#define IS3                           1506
#define CWG1IS3                       1507
#define WDTCON0                       1508
#define WDTCON0_SEN                   1509
#define SWDTEN                        1510
#define WDTSEN                        1511
#define WDTPS                         1512
#define WDTPS0                        1513
#define WDTPS1                        1514
#define WDTPS2                        1515
#define WDTPS3                        1516
#define WDTPS4                        1517
#define WDTCON1                       1518
#define WDTWINDOW0                    1519
#define WINDOW0                       1520
#define WINDOW                        1521
#define WDTWINDOW                     1522
#define WDTWINDOW1                    1523
#define WINDOW1                       1524
#define WDTWINDOW2                    1525
#define WINDOW2                       1526
#define WDTCS                         1527
#define WDTCS0                        1528
#define WDTCS1                        1529
#define WDTCS2                        1530
#define WDTPSL                        1531
#define WDTPSL_WDTPSCNT               1532
#define WDTPSL_PSCNT                  1533
#define WDTPSCNT0                     1534
#define PSCNT0                        1535
#define WDTPSCNT1                     1536
#define PSCNT1                        1537
#define WDTPSCNT2                     1538
#define PSCNT2                        1539
#define WDTPSCNT3                     1540
#define PSCNT3                        1541
#define WDTPSCNT4                     1542
#define PSCNT4                        1543
#define WDTPSCNT5                     1544
#define PSCNT5                        1545
#define WDTPSCNT6                     1546
#define PSCNT6                        1547
#define WDTPSCNT7                     1548
#define PSCNT7                        1549
#define WDTPSH                        1550
#define PSCNT8                        1551
#define WDTPSH_WDTPSCNT               1552
#define WDTPSH_PSCNT                  1553
#define WDTPSCNT8                     1554
#define PSCNT9                        1555
#define WDTPSCNT9                     1556
#define PSCNT10                       1557
#define WDTPSCNT10                    1558
#define PSCNT11                       1559
#define WDTPSCNT11                    1560
#define PSCNT12                       1561
#define WDTPSCNT12                    1562
#define PSCNT13                       1563
#define WDTPSCNT13                    1564
#define PSCNT14                       1565
#define WDTPSCNT14                    1566
#define PSCNT15                       1567
#define WDTPSCNT15                    1568
#define PSCNT16                       1569
#define WDTPSCNT16                    1570
#define WDTPSCNT17                    1571
#define PSCNT17                       1572
#define STATE                         1573
#define WDTSTATE                      1574
#define WDTTMR                        1575
#define WDTTMR0                       1576
#define WDTTMR1                       1577
#define WDTTMR2                       1578
#define WDTTMR3                       1579
#define WDTTMR4                       1580
#define SCANLADRL                     1581
#define SCANLADRL_LADR                1582
#define LDAR0                         1583
#define SCANLADRL_SCANLADR            1584
#define SCANLADR0                     1585
#define SCANLADR1                     1586
#define LDAR1                         1587
#define LADR2                         1588
#define SCANLADR2                     1589
#define LADR3                         1590
#define SCANLADR3                     1591
#define LADR4                         1592
#define SCANLADR4                     1593
#define LADR5                         1594
#define SCANLADR5                     1595
#define SCANLADR6                     1596
#define LADR6                         1597
#define LADR7                         1598
#define SCANLADR7                     1599
#define SCANLADRH                     1600
#define LADR8                         1601
#define SCANLADRH_SCANLADR            1602
#define SCANLADR8                     1603
#define SCANLADRH_LADR                1604
#define LADR9                         1605
#define SCANLADR9                     1606
#define LADR10                        1607
#define SCANLADR10                    1608
#define SCANLADR11                    1609
#define LADR11                        1610
#define LADR12                        1611
#define SCANLADR12                    1612
#define LADR13                        1613
#define SCANLADR13                    1614
#define LADR14                        1615
#define SCANLADR14                    1616
#define LADR15                        1617
#define SCANLADR15                    1618
#define SCANHADRL                     1619
#define SCANHADR0                     1620
#define HADR0                         1621
#define SCANHADRL_HADR                1622
#define SCANHADRL_SCANHADR            1623
#define SCANHADR1                     1624
#define HADR1                         1625
#define SCANHADR2                     1626
#define HARD2                         1627
#define SCANHADR3                     1628
#define HADR3                         1629
#define SCANHADR4                     1630
#define HADR4                         1631
#define SCANHADR5                     1632
#define HADR5                         1633
#define SCANHADR6                     1634
#define HADR6                         1635
#define SCANHADR7                     1636
#define HADR7                         1637
#define SCANHADRH                     1638
#define HADR8                         1639
#define SCANHADRH_SCANHADR            1640
#define SCANHADR8                     1641
#define SCANHADRH_HADR                1642
#define HADR9                         1643
#define SCANHADR9                     1644
#define HADR10                        1645
#define SCANHADR10                    1646
#define SCANHADR11                    1647
#define HADR11                        1648
