tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1615_tdd.h
#define HADR12                        1649
#define SCANHADR12                    1650
#define HADR13                        1651
#define SCANHADR13                    1652
#define HADR14                        1653
#define SCANHADR14                    1654
#define HADR15                        1655
#define SCANHADR15                    1656
#define SCANCON0                      1657
#define SCANMODE                      1658
#define SCANMODE0                     1659
#define SCANCON0_MODE0                1660
#define SCANCON0_MODE                 1661
#define SCANCON0_MODE1                1662
#define SCANMODE1                     1663
#define INTM                          1664
#define SCANINTM                      1665
#define INVALID                       1666
#define SCANINVALID                   1667
#define SCANCON0_BUSY                 1668
#define SCANBUSY                      1669
#define SCANGO                        1670
#define SCANEN                        1671
#define SCANCON0_EN                   1672
#define SCANTRIG                      1673
#define TSEL0                         1674
#define TSEL                          1675
#define SCANTSEL0                     1676
#define SCANTSEL                      1677
#define TSEL1                         1678
#define SCANTSEL1                     1679
#define TSEL2                         1680
#define SCANTSEL2                     1681
#define TSEL3                         1682
#define SCANTSEL3                     1683
#define CRCDATL                       1684
#define CRCDATL_DAT                   1685
#define CRCDAT0                       1686
#define DAT0                          1687
#define CRCDATL_CRCDAT                1688
#define CRCDAT1                       1689
#define DAT1                          1690
#define CRCDAT2                       1691
#define DAT2                          1692
#define CRCDAT3                       1693
#define DAT3                          1694
#define CRCDAT4                       1695
#define DAT4                          1696
#define CRCDAT5                       1697
#define DAT5                          1698
#define CRCDAT6                       1699
#define DAT6                          1700
#define DAT7                          1701
#define CRDCDAT7                      1702
#define CRCDATH                       1703
#define CRCDAT8                       1704
#define DAT8                          1705
#define CRCDATH_CRCDAT                1706
#define CRCDATH_DAT                   1707
#define CRCDAT9                       1708
#define DAT9                          1709
#define DAT10                         1710
#define CRCDAT10                      1711
#define DAT11                         1712
#define CRCDAT11                      1713
#define DAT12                         1714
#define CRCDAT12                      1715
#define DAT13                         1716
#define CRCDAT13                      1717
#define DAT14                         1718
#define CRCDAT14                      1719
#define DAT15                         1720
#define CRCDAT15                      1721
#define CRCACCL                       1722
#define CRCACCL_CRCACC                1723
#define CRCACC0                       1724
#define CRCACCL_ACC0                  1725
#define CRCACCL_ACC                   1726
#define CRCACC1                       1727
#define CRCACCL_ACC1                  1728
#define CRCACC2                       1729
#define CRCACCL_ACC2                  1730
#define CRCACC3                       1731
#define CRCACCL_ACC3                  1732
#define CRCACC4                       1733
#define CRCACCL_ACC4                  1734
#define CRCACC5                       1735
#define CRCACCL_ACC5                  1736
#define CRCACC6                       1737
#define CRCACCL_ACC6                  1738
#define CRCACC7                       1739
#define CRCACCL_ACC7                  1740
#define CRCACCH                       1741
#define CRCACCH_ACC                   1742
#define CRCACCH_CRCACC                1743
#define CRCACC8                       1744
#define CRCACCH_ACC8                  1745
#define CRCACC9                       1746
#define CRCACCH_ACC9                  1747
#define CRCACCH_ACC10                 1748
#define CRCACC10                      1749
#define CRCACCH_ACC11                 1750
#define CRCACC11                      1751
#define CRCACCH_ACC12                 1752
#define CRCACC12                      1753
#define CRCACCH_ACC13                 1754
#define CRCACC13                      1755
#define CRCACCH_ACC14                 1756
#define CRCACC14                      1757
#define CRCACCH_ACC15                 1758
#define CRCACC15                      1759
#define CRCSHIFTL                     1760
#define CRCSHIFTL_CRCSHIFT            1761
#define CRCSHIFTL_SHIFT               1762
#define SHIFT0                        1763
#define CRCSHIFT0                     1764
#define SHIFT1                        1765
#define CRCSHIFT1                     1766
#define SHIFT2                        1767
#define CRCSHIFT2                     1768
#define SHIFT3                        1769
#define CRCSHIFT3                     1770
#define SHIFT4                        1771
#define CRCSHIFT4                     1772
#define SHIFT5                        1773
#define CRCSHIFT5                     1774
#define SHIFT6                        1775
#define CRCSHIFT6                     1776
#define SHIFT7                        1777
#define CRCSHIFT7                     1778
#define CRCSHIFTH                     1779
#define CRCSHIFT8                     1780
#define CRCSHIFTH_SHIFT               1781
#define CRCSHIFTH_CRCSHIFT            1782
#define SHIFT8                        1783
#define CRCSHIFT9                     1784
#define SHIFT9                        1785
#define SHIFT10                       1786
#define CRCSHIFT10                    1787
#define SHIFT11                       1788
#define CRCSHIFT11                    1789
#define SHIFT12                       1790
#define CRCSHIFT12                    1791
#define SHIFT13                       1792
#define CRCSHIFT13                    1793
#define CRCSHIFT14                    1794
#define SHIFT14                       1795
#define SHIFT15                       1796
#define CRCSHIFT15                    1797
#define CRCXORL                       1798
#define XOR1                          1799
#define CRCXOR1                       1800
#define XOR2                          1801
#define CRCXOR2                       1802
#define XOR3                          1803
#define CRCXOR3                       1804
#define XOR4                          1805
#define CRCXOR4                       1806
#define XOR5                          1807
#define CRCXOR5                       1808
#define XOR6                          1809
#define CRCXOR6                       1810
#define XOR7                          1811
#define CRCXOR7                       1812
#define CRCXORH                       1813
#define XOR8                          1814
#define CRCXOR8                       1815
#define XOR9                          1816
#define CRCXOR9                       1817
#define CRCXOR10                      1818
#define XOR10                         1819
#define CRCXOR11                      1820
#define XOR11                         1821
#define XOR12                         1822
#define CRCXOR12                      1823
#define XOR13                         1824
#define CRCXOR13                      1825
#define CRCXOR14                      1826
#define XOR14                         1827
#define CRCXOR15                      1828
#define XOR15                         1829
#define CRCCON0                       1830
#define CRCFULL                       1831
#define FULL                          1832
#define CRCSHIFTM                     1833
#define SHIFTM                        1834
#define ACCM                          1835
#define CRCACCM                       1836
#define CRCCON0_BUSY                  1837
#define CRCBUSY                       1838
#define CRCGO                         1839
#define CRCCON0_EN                    1840
#define CRCEN                         1841
#define CRCCON1                       1842
#define PLEN0                         1843
#define CRCPLEN0                      1844
#define PLEN                          1845
#define CRCPLEN                       1846
#define PLEN1                         1847
#define CRCPLEN1                      1848
#define PLEN2                         1849
#define CRCPLEN2                      1850
#define PLEN3                         1851
#define CRCPLEN3                      1852
#define DLEN                          1853
#define CRCDLEN                       1854
#define CRCDLEN0                      1855
#define DLEN0                         1856
#define DLEN1                         1857
#define CRCDLEN1                      1858
#define CRCDLEN2                      1859
#define DLEN2                         1860
#define DLEN3                         1861
#define CRCDLEN3                      1862
#define AT1RESL                       1863
#define AT1RES0                       1864
#define RES0                          1865
#define RES1                          1866
#define AT1RES1                       1867
#define AT1RES2                       1868
#define RES2                          1869
#define AT1RES3                       1870
#define RES3                          1871
#define AT1RES4                       1872
#define RES4                          1873
#define AT1RES5                       1874
#define RES5                          1875
#define RES6                          1876
#define AT1RES6                       1877
#define AT1RES7                       1878
#define RES7                          1879
#define AT1RESH                       1880
#define RES8                          1881
#define AT1RES8                       1882
#define RES9                          1883
#define AT1RES9                       1884
#define AT1MISSL                      1885
#define AT1MISS0                      1886
#define MISS0                         1887
#define AT1MISS1                      1888
#define MISS1                         1889
#define AT1MISS2                      1890
#define MISS2                         1891
#define AT1MISS3                      1892
#define MISS3                         1893
#define AT1MISS4                      1894
#define MISS4                         1895
#define AT1MISS5                      1896
#define MISS5                         1897
#define AT1MISS6                      1898
#define MISS6                         1899
#define AT1MISS7                      1900
#define MISS7                         1901
#define AT1MISSH                      1902
#define MISS8                         1903
#define AT1MISS8                      1904
#define MISS9                         1905
#define AT1MISS9                      1906
#define MISS10                        1907
#define AT1MISS10                     1908
#define MISS11                        1909
#define AT1MISS11                     1910
#define AT1MISS12                     1911
#define MISS12                        1912
#define AT1MISS13                     1913
#define MISS13                        1914
#define AT1MISS14                     1915
#define MISS14                        1916
#define AT1MISS15                     1917
#define MISS15                        1918
#define AT1PERL                       1919
#define PER0                          1920
#define AT1PER0                       1921
#define PERL0                         1922
#define PER1                          1923
#define AT1PER1                       1924
#define PERL1                         1925
#define PER2                          1926
#define AT1PER2                       1927
#define PERL2                         1928
#define PER3                          1929
#define AT1PER3                       1930
#define PERL3                         1931
#define PER4                          1932
#define AT1PER4                       1933
#define PERL4                         1934
#define PER5                          1935
#define AT1PER5                       1936
#define PERL5                         1937
#define PER6                          1938
#define AT1PER6                       1939
#define PERL6                         1940
#define PER7                          1941
#define AT1PER7                       1942
#define PERL7                         1943
#define AT1PERH                       1944
#define PER8                          1945
#define AT1PER8                       1946
#define PERH0                         1947
#define PER9                          1948
#define AT1PER9                       1949
#define PERH1                         1950
#define AT1PER10                      1951
#define PER10                         1952
#define PERH2                         1953
#define AT1PER11                      1954
#define PER11                         1955
#define PERH3                         1956
#define AT1PER12                      1957
#define PER12                         1958
#define PERH4                         1959
#define AT1PER13                      1960
#define PER13                         1961
#define PERH5                         1962
#define AT1PER14                      1963
#define PER14                         1964
#define PERH6                         1965
#define PER15                         1966
#define AT1POV                        1967
#define PERH7                         1968
#define AT1PHSL                       1969
#define PHS0                          1970
#define AT1PHS0                       1971
#define PHS1                          1972
#define AT1PHS1                       1973
#define PHS2                          1974
#define AT1PHS2                       1975
#define PHS3                          1976
#define AT1PHS3                       1977
#define PHS4                          1978
#define AT1PHS4                       1979
#define PHS5                          1980
#define AT1PHS5                       1981
#define PHS6                          1982
#define AT1PHS6                       1983
#define PHS7                          1984
#define AT1PHS7                       1985
#define AT1PHSH                       1986
#define PHSL8                         1987
#define PHS8                          1988
#define AT1PHS8                       1989
#define PHSL9                         1990
#define PHS9                          1991
#define AT1PHS9                       1992
#define AT1CON0                       1993
#define AT1CON0_MODE                  1994
#define AT1MODE                       1995
#define APMOD                         1996
#define AT1APMOD                      1997
#define AT1CON0_POL                   1998
#define AT1POL                        1999
#define AT1PS0                        2000
#define AT1CON0_PS                    2001
#define AT1PS                         2002
#define AT1CON0_PS0                   2003
#define AT1PS1                        2004
#define AT1CON0_PS1                   2005
#define PREC                          2006
#define AT1PREC                       2007
#define AT1CON0_EN                    2008
#define AT1EN                         2009
#define AT1CON1                       2010
#define AT1VALID                      2011
#define VALID                         2012
#define AT1ACCS                       2013
#define ACCS                          2014
#define MPP                           2015
#define AT1MPP                        2016
#define AT1PRP                        2017
#define PRP                           2018
#define AT1PHP                        2019
#define PHP                           2020
#define AT1IR0                        2021
#define AT1PERIF                      2022
#define AT1MISSIF                     2023
#define AT1PHSIF                      2024
#define AT1IE0                        2025
#define AT1PERIE                      2026
#define AT1MISSIE                     2027
#define AT1PHSIE                      2028
#define AT1IR1                        2029
#define AT1CC1IF                      2030
#define AT1CC2IF                      2031
#define AT1CC3IF                      2032
#define AT1IE1                        2033
#define AT1CC1IE                      2034
#define AT1CC2IE                      2035
#define AT1CC3IE                      2036
#define AT1STPTL                      2037
#define STPT0                         2038
#define AT1STPT0                      2039
#define STPT1                         2040
#define AT1STPT1                      2041
#define STPT2                         2042
#define AT1STPT2                      2043
#define STPT3                         2044
#define AT1STPT3                      2045
#define STPT4                         2046
#define AT1STPT4                      2047
#define STPT5                         2048
#define AT1STPT5                      2049
#define STPT6                         2050
#define AT1STPT6                      2051
#define STPT7                         2052
#define AT1STPT7                      2053
#define AT1STPTH                      2054
#define STPT8                         2055
#define AT1STPT8                      2056
#define STPT9                         2057
#define AT1STPT9                      2058
#define AT1STPT10                     2059
#define STPT10                        2060
#define AT1STPT11                     2061
#define STPT11                        2062
#define AT1STPT12                     2063
#define STPT12                        2064
#define AT1STPT13                     2065
#define STPT13                        2066
#define AT1STPT14                     2067
#define STPT14                        2068
#define AT1ERRL                       2069
#define AT1ERR0                       2070
#define ERR0                          2071
#define ERRL0                         2072
#define AT1ERR1                       2073
#define ERR1                          2074
#define ERRL1                         2075
#define AT1ERR2                       2076
#define ERR2                          2077
#define ERRL2                         2078
#define AT1ERR3                       2079
#define ERR3                          2080
#define ERRL3                         2081
#define AT1ERR4                       2082
#define ERRL4                         2083
#define ERR4                          2084
#define AT1ERR5                       2085
#define ERRL5                         2086
#define ERR5                          2087
#define AT1ERR6                       2088
#define ERRL6                         2089
#define ERR6                          2090
#define AT1ERR7                       2091
#define ERRL7                         2092
#define ERR7                          2093
#define AT1ERRH                       2094
#define AT1ERR8                       2095
#define ERRH0                         2096
#define ERR8                          2097
#define AT1ERR9                       2098
#define ERRH1                         2099
#define ERR9                          2100
#define AT1ERR10                      2101
#define ERR10                         2102
#define ERRH2                         2103
#define AT1ERR11                      2104
#define ERR11                         2105
#define ERRH3                         2106
#define AT1ERR12                      2107
#define ERR12                         2108
#define ERRH4                         2109
#define AT1ERR13                      2110
#define ERR13                         2111
#define ERRH5                         2112
#define AT1ERR14                      2113
#define ERR14                         2114
#define ERRH6                         2115
#define AT1ERR15                      2116
#define ERR15                         2117
#define ERRH7                         2118
#define AT1CLK                        2119
#define AT1CLK_CS                     2120
#define AT1CS                         2121
#define AT1CLK_CS0                    2122
#define AT1CS0                        2123
#define AT1SIG                        2124
#define AT1SSEL0                      2125
#define AT1SIG_SSEL0                  2126
#define AT1SIG_SSEL                   2127
#define AT1SSEL                       2128
#define AT1SSEL1                      2129
#define AT1SIG_SSEL1                  2130
#define AT1SSEL2                      2131
#define AT1SIG_SSEL2                  2132
#define AT1CSEL1                      2133
#define CP1S0                         2134
#define AT1CP1S0                      2135
#define AT1CP1S                       2136
#define CP1S                          2137
#define CP1S1                         2138
#define AT1CP1S1                      2139
#define CP1S2                         2140
#define AT1CP1S2                      2141
#define AT1CC1L                       2142
#define AT1CC10                       2143
#define CC10                          2144
#define AT1CC11                       2145
#define CC11                          2146
#define AT1CC12                       2147
#define CC12                          2148
#define AT1CC1L_CC13                  2149
#define AT1CC13                       2150
#define AT1CC14                       2151
#define CC14                          2152
#define AT1CC15                       2153
#define CC15                          2154
#define AT1CC16                       2155
#define CC16                          2156
#define AT1CC17                       2157
#define CC17                          2158
#define AT1CC1H                       2159
#define CC18                          2160
#define AT1CC18                       2161
#define CC19                          2162
#define AT1CC19                       2163
#define AT1CCON1                      2164
#define AT1CC1MODE                    2165
#define CC1MODE                       2166
#define CAP1P                         2167
#define AT1CAP1P                      2168
#define CC1POL                        2169
#define AT1CC1POL                     2170
#define AT1CC1EN                      2171
#define CC1EN                         2172
#define AT1CSEL2                      2173
#define AT1CP2S0                      2174
#define AT1CP2S                       2175
#define CP2S0                         2176
#define CP2S                          2177
#define CP2S1                         2178
#define AT1CP2S1                      2179
#define AT1CP2S2                      2180
#define CP2S2                         2181
#define AT1CC2L                       2182
#define AT1CC20                       2183
#define CC20                          2184
#define AT1CC21                       2185
#define CC21                          2186
#define AT1CC22                       2187
#define CC22                          2188
#define AT1CC23                       2189
#define AT1CC2L_CC13                  2190
#define AT1CC24                       2191
#define CC24                          2192
#define AT1CC25                       2193
#define CCW5                          2194
#define AT1CC26                       2195
#define CC26                          2196
#define AT1CC27                       2197
#define CC27                          2198
#define AT1CC2H                       2199
#define CC28                          2200
#define AT1CC28                       2201
#define CC29                          2202
#define AT1CC29                       2203
#define AT1CCON2                      2204
#define CC2MODE                       2205
#define AT1CC2MODE                    2206
