tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1615_tdd.h
#define AT1CAP2P                      2207
#define CAP2P                         2208
#define AT1CC2POL                     2209
#define CC2POL                        2210
#define CC2EN                         2211
#define AT1CC2EN                      2212
#define AT1CSEL3                      2213
#define CP3S0                         2214
#define AT1CP3S                       2215
#define AT1CP3S0                      2216
#define CP3S                          2217
#define CP3S1                         2218
#define AT1CP3S1                      2219
#define CP3S2                         2220
#define AT1CP3S2                      2221
#define AT1CC3L                       2222
#define AT1CC30                       2223
#define CC30                          2224
#define AT1CC31                       2225
#define CC31                          2226
#define AT1CC32                       2227
#define CC32                          2228
#define AT1CC33                       2229
#define CC33                          2230
#define AT1CC34                       2231
#define CC34                          2232
#define AT1CC35                       2233
#define CC35                          2234
#define AT1CC36                       2235
#define CC36                          2236
#define AT1CC37                       2237
#define CC37                          2238
#define AT1CC3H                       2239
#define CC38                          2240
#define AT1CC38                       2241
#define CC39                          2242
#define AT1CC39                       2243
#define AT1CCON3                      2244
#define AT1CC3MODE                    2245
#define CC3MODE                       2246
#define AT1CAP3P                      2247
#define CAP3P                         2248
#define AT1CC3POL                     2249
#define CC3POL                        2250
#define CC3EN                         2251
#define AT1CC3EN                      2252
#define SMT1TMRL                      2253
#define SMT1TMR0                      2254
#define SMT1TMRL_SMT1TMR              2255
#define SMT1TMR1                      2256
#define SMT1TMR2                      2257
#define SMT1TMR3                      2258
#define SMT1TMR4                      2259
#define SMT1TMR5                      2260
#define SMT1TMR6                      2261
#define SMT1TMR7                      2262
#define SMT1TMRH                      2263
#define SMT1TMR8                      2264
#define SMT1TMRH_SMT1TMR              2265
#define SMT1TMR9                      2266
#define SMT1TMR10                     2267
#define SMT1TMR11                     2268
#define SMT1TMR12                     2269
#define SMT1TMR13                     2270
#define SMT1TMR14                     2271
#define SMT1TMR15                     2272
#define SMT1TMRU                      2273
#define SMT1TMR16                     2274
#define SMT1TMRU_SMT1TMR              2275
#define SMT1TMR17                     2276
#define SMT1TMR18                     2277
#define SMT1TMR19                     2278
#define SMT1TMR20                     2279
#define SMT1TMR21                     2280
#define SMT1TMR22                     2281
#define SMT1TMR23                     2282
#define SMT1CPRL                      2283
#define SMT1CPRL_SMT1CPR              2284
#define SMT1CPR0                      2285
#define SMT1CPR1                      2286
#define SMT1CPR2                      2287
#define SMT1CPR3                      2288
#define SMT1CPR4                      2289
#define SMT1CPR5                      2290
#define SMT1CPR6                      2291
#define SMT1CPR7                      2292
#define SMT1CPRH                      2293
#define SMT1CPRH_SMT1CPR              2294
#define SMT1CPR8                      2295
#define SMT1CPR9                      2296
#define SMT1CPR10                     2297
#define SMT1CPR11                     2298
#define SMT1CPR12                     2299
#define SMT1CPR13                     2300
#define SMT1CPR14                     2301
#define SMT1CPR15                     2302
#define SMT1CPRU                      2303
#define SMT1CPR16                     2304
#define SMT1CPRU_SMT1CPR              2305
#define SMT1CPR17                     2306
#define SMT1CPR18                     2307
#define SMT1CPR19                     2308
#define SMT1CPR20                     2309
#define SMT1CPR21                     2310
#define SMT1CPR22                     2311
#define SMT1CPR23                     2312
#define SMT1CPWL                      2313
#define SMT1CPW0                      2314
#define SMT1CPWL_SMT1CPW              2315
#define SMT1CPW1                      2316
#define SMT1CPW2                      2317
#define SMT1CPW3                      2318
#define SMT1CPW4                      2319
#define SMT1CPW5                      2320
#define SMT1CPW6                      2321
#define SMT1CPW7                      2322
#define SMT1CPWH                      2323
#define SMT1CPW8                      2324
#define SMT1CPWH_SMT1CPW              2325
#define SMT1CPW9                      2326
#define SMT1CPW10                     2327
#define SMT1CPW11                     2328
#define SMT1CPW12                     2329
#define SMT1CPW13                     2330
#define SMT1CPW14                     2331
#define SMT1CPW15                     2332
#define SMT1CPWU                      2333
#define SMT1CPWU_SMT1CPW              2334
#define SMT1CPW16                     2335
#define SMT1CPW17                     2336
#define SMT1CPW18                     2337
#define SMT1CPW19                     2338
#define SMT1CPW20                     2339
#define SMT1CPW21                     2340
#define SMT1CPW22                     2341
#define SMT1CPW23                     2342
#define SMT1PRL                       2343
#define SMT1PR0                       2344
#define SMT1PRL_SMT1PR                2345
#define SMT1PR1                       2346
#define SMT1PR2                       2347
#define SMT1PR3                       2348
#define SMT1PR4                       2349
#define SMT1PR5                       2350
#define SMT1PR6                       2351
#define SMT1PR7                       2352
#define SMT1PRH                       2353
#define SMT1PR8                       2354
#define SMT1PRH_SMT1PR                2355
#define SMT1PR9                       2356
#define SMT1PR10                      2357
#define SMT1PR11                      2358
#define SMT1PR12                      2359
#define SMT1PR13                      2360
#define SMT1PR14                      2361
#define SMT1PR15                      2362
#define SMT1PRU                       2363
#define SMT1PR16                      2364
#define SMT1PRU_SMT1PR                2365
#define SMT1PR17                      2366
#define SMT1PR18                      2367
#define SMT1PR19                      2368
#define SMT1PR20                      2369
#define SMT1PR21                      2370
#define SMT1PR22                      2371
#define SMT1PR23                      2372
#define SMT1CON0                      2373
#define SMT1PS0                       2374
#define SMT1PS                        2375
#define SMT1PS1                       2376
#define SMT1CON0_CPOL                 2377
#define SMT1CON0_SPOL                 2378
#define SMT1CON0_WPOL                 2379
#define SMT1CON0_STP                  2380
#define SMT1CON0_EN                   2381
#define SMT1CON1                      2382
#define SMT1MODE0                     2383
#define SMT1CON1_MODE                 2384
#define SMT1CON1_MODE0                2385
#define SMT1MODE                      2386
#define SMT1CON1_MODE1                2387
#define SMT1MODE1                     2388
#define SMT1CON1_MODE2                2389
#define SMT1MODE2                     2390
#define SMT1CON1_MODE3                2391
#define SMT1MODE3                     2392
#define SMT1CON1_REPEAT               2393
#define SMT1REPEAT                    2394
#define SMT1GO                        2395
#define SMT1STAT                      2396
#define SMT1STAT_AS                   2397
#define SMT1AS                        2398
#define SMT1STAT_WS                   2399
#define SMT1WS                        2400
#define SMT1STAT_TS                   2401
#define SMT1TS                        2402
#define SMT1RESET                     2403
#define SMT1STAT_RST                  2404
#define SMT1CPWUP                     2405
#define SMT1STAT_CPWUP                2406
#define SMT1CPRUP                     2407
#define SMT1STAT_CPRUP                2408
#define SMT1CLK                       2409
#define SMT1CLK_CSEL0                 2410
#define SMT1CSEL0                     2411
#define SMT1CSEL                      2412
#define SMT1CLK_CSEL                  2413
#define SMT1CSEL1                     2414
#define SMT1CLK_CSEL1                 2415
#define SMT1CSEL2                     2416
#define SMT1CLK_CSEL2                 2417
#define SMT1SIG                       2418
#define SMT1SSEL                      2419
#define SMT1SIG_SSEL0                 2420
#define SMT1SIG_SSEL                  2421
#define SMT1SSEL0                     2422
#define SMT1SIG_SSEL1                 2423
#define SMT1SSEL1                     2424
#define SMT1SIG_SSEL2                 2425
#define SMT1SSEL2                     2426
#define SMT1SIG_SSEL3                 2427
#define SMT1SSEL3                     2428
#define SMT1SIG_SSEL4                 2429
#define SMT1SSEL4                     2430
#define SMT1WIN                       2431
#define SMT1WSEL                      2432
#define SMT1WSEL0                     2433
#define SMT1WIN_WSEL0                 2434
#define SMT1WIN_WSEL                  2435
#define SMT1WSEL1                     2436
#define SMT1WIN_WSEL1                 2437
#define SMT1WIN_WSEL2                 2438
#define SMT1WSEL2                     2439
#define SMT1WIN_WSEL3                 2440
#define SMT1WSEL3                     2441
#define SMT1WIN_WSEL4                 2442
#define SMT1WSEL4                     2443
#define SMT2TMRL                      2444
#define SMT2TMRL_SMT2TMR              2445
#define SMT2TMR0                      2446
#define SMT2TMR1                      2447
#define SMT2TMR2                      2448
#define SMT2TMR3                      2449
#define SMT2TMR4                      2450
#define SMT2TMR5                      2451
#define SMT2TMR6                      2452
#define SMT2TMR7                      2453
#define SMT2TMRH                      2454
#define SMT2TMR8                      2455
#define SMT2TMRH_SMT2TMR              2456
#define SMT2TMR9                      2457
#define SMT2TMR10                     2458
#define SMT2TMR11                     2459
#define SMT2TMR12                     2460
#define SMT2TMR13                     2461
#define SMT2TMR14                     2462
#define SMT2TMR15                     2463
#define SMT2TMRU                      2464
#define SMT2TMR16                     2465
#define SMT2TMRU_SMT2TMR              2466
#define SMT2TMR17                     2467
#define SMT2TMR18                     2468
#define SMT2TMR19                     2469
#define SMT2TMR20                     2470
#define SMT2TMR21                     2471
#define SMT2TMR22                     2472
#define SMT2TMR23                     2473
#define SMT2CPRL                      2474
#define SMT2CPRL_SMT2CPR              2475
#define SMT2CPR0                      2476
#define SMT2CPR1                      2477
#define SMT2CPR2                      2478
#define SMT2CPR3                      2479
#define SMT2CPR4                      2480
#define SMT2CPR5                      2481
#define SMT2CPR6                      2482
#define SMT2CPR7                      2483
#define SMT2CPRH                      2484
#define SMT2CPR8                      2485
#define SMT2CPRH_SMT2CPR              2486
#define SMT2CPR9                      2487
#define SMT2CPR10                     2488
#define SMT2CPR11                     2489
#define SMT2CPR12                     2490
#define SMT2CPR13                     2491
#define SMT2CPR14                     2492
#define SMT2CPR15                     2493
#define SMT2CPRU                      2494
#define SMT2CPRU_SMT2CPR              2495
#define SMT2CPR16                     2496
#define SMT2CPR17                     2497
#define SMT2CPR18                     2498
#define SMT2CPR19                     2499
#define SMT2CPR20                     2500
#define SMT2CPR21                     2501
#define SMT2CPR22                     2502
#define SMT2CPR23                     2503
#define SMT2CPWL                      2504
#define SMT2CPWL_SMT2CPW              2505
#define SMT2CPW0                      2506
#define SMT2CPW1                      2507
#define SMT2CPW2                      2508
#define SMT2CPW3                      2509
#define SMT2CPW4                      2510
#define SMT2CPW5                      2511
#define SMT2CPW6                      2512
#define SMT2CPW7                      2513
#define SMT2CPWH                      2514
#define SMT2CPWH_SMT2CPW              2515
#define SMT2CPW8                      2516
#define SMT2CPW9                      2517
#define SMT2CPW10                     2518
#define SMT2CPW11                     2519
#define SMT2CPW12                     2520
#define SMT2CPW13                     2521
#define SMT2CPW14                     2522
#define SMT2CPW15                     2523
#define SMT2CPWU                      2524
#define SMT2CPWU_SMT2CPW              2525
#define SMT2CPW16                     2526
#define SMT2CPW17                     2527
#define SMT2CPW18                     2528
#define SMT2CPW19                     2529
#define SMT2CPW20                     2530
#define SMT2CPW21                     2531
#define SMT2CPW22                     2532
#define SMT2CPW23                     2533
#define SMT2PRL                       2534
#define SMT2PRL_SMT2PR                2535
#define SMT2PR0                       2536
#define SMT2PR1                       2537
#define SMT2PR2                       2538
#define SMT2PR3                       2539
#define SMT2PR4                       2540
#define SMT2PR5                       2541
#define SMT2PR6                       2542
#define SMT2PR7                       2543
#define SMT2PRH                       2544
#define SMT2PRH_SMT2PR                2545
#define SMT2PR8                       2546
#define SMT2PR9                       2547
#define SMT2PR10                      2548
#define SMT2PR11                      2549
#define SMT2PR12                      2550
#define SMT2PR13                      2551
#define SMT2PR14                      2552
#define SMT2PR15                      2553
#define SMT2PRU                       2554
#define SMT2PRU_SMT2PR                2555
#define SMT2PR16                      2556
#define SMT2PR17                      2557
#define SMT2PR18                      2558
#define SMT2PR19                      2559
#define SMT2PR20                      2560
#define SMT2PR21                      2561
#define SMT2PR22                      2562
#define SMT2PR23                      2563
#define SMT2CON0                      2564
#define SMT2PS0                       2565
#define SMT2PS                        2566
#define SMT2PS1                       2567
#define SMT2CON0_CPOL                 2568
#define SMT2CON0_SPOL                 2569
#define SMT2CON0_WPOL                 2570
#define SMT2CON0_STP                  2571
#define SMT2CON0_EN                   2572
#define SMT2CON1                      2573
#define SMT2CON1_MODE                 2574
#define SMT2CON1_MODE0                2575
#define SMT2MODE0                     2576
#define SMT2MODE                      2577
#define SMT2CON1_MODE1                2578
#define SMT2MODE1                     2579
#define SMT2CON1_MODE2                2580
#define SMT2MODE2                     2581
#define SMT2CON1_MODE3                2582
#define SMT2MODE3                     2583
#define SMT2REPEAT                    2584
#define SMT2CON1_REPEAT               2585
#define SMT2GO                        2586
#define SMT2STAT                      2587
#define SMT2AS                        2588
#define SMT2STAT_AS                   2589
#define SMT2WS                        2590
#define SMT2STAT_WS                   2591
#define SMT2STAT_TS                   2592
#define SMT2TS                        2593
#define SMT2RESET                     2594
#define SMT2STAT_RST                  2595
#define SMT2CPWUP                     2596
#define SMT2STAT_CPWUP                2597
#define SMT2STAT_CPRUP                2598
#define SMT2CPRUP                     2599
#define SMT2CLK                       2600
#define SMT2CLK_CSEL                  2601
#define SMT2CLK_CSEL0                 2602
#define SMT2CSEL0                     2603
#define SMT2CSEL                      2604
#define SMT2CLK_CSEL1                 2605
#define SMT2CSEL1                     2606
#define SMT2CLK_CSEL2                 2607
#define SMT2CSEL2                     2608
#define SMT2SIG                       2609
#define SMT2SIG_SSEL                  2610
#define SMT2SSEL0                     2611
#define SMT2SSEL                      2612
#define SMT2SIG_SSEL0                 2613
#define SMT2SSEL1                     2614
#define SMT2SIG_SSEL1                 2615
#define SMT2SSEL2                     2616
#define SMT2SIG_SSEL2                 2617
#define SMT2SIG_SSEL3                 2618
#define SMT2SSEL3                     2619
#define SMT2SSEL4                     2620
#define SMT2SIG_SSEL4                 2621
#define SMT2WIN                       2622
#define SMT2WIN_WSEL0                 2623
#define SMT2WSEL0                     2624
#define SMT2WSEL                      2625
#define SMT2WIN_WSEL                  2626
#define SMT2WSEL1                     2627
#define SMT2WIN_WSEL1                 2628
#define SMT2WSEL2                     2629
#define SMT2WIN_WSEL2                 2630
#define SMT2WSEL3                     2631
#define SMT2WIN_WSEL3                 2632
#define SMT2WSEL4                     2633
#define SMT2WIN_WSEL4                 2634
#define PPSLOCK                       2635
#define PPSLOCKED                     2636
#define INTPPS                        2637
#define INTPPS0                       2638
#define INTPPS1                       2639
#define INTPPS2                       2640
#define INTPPS3                       2641
#define INTPPS4                       2642
#define T0CKIPPS                      2643
#define T0CKIPPS0                     2644
#define T0CKIPPS1                     2645
#define T0CKIPPS2                     2646
#define T0CKIPPS3                     2647
#define T0CKIPPS4                     2648
#define T1CKIPPS                      2649
#define T1CKIPPS0                     2650
#define T1CKIPPS1                     2651
#define T1CKIPPS2                     2652
#define T1CKIPPS3                     2653
#define T1CKIPPS4                     2654
#define T1GPPS                        2655
#define T1GPPS0                       2656
#define T1GPPS1                       2657
#define T1GPPS2                       2658
#define T1GPPS3                       2659
#define T1GPPS4                       2660
#define CCP1PPS                       2661
#define CCP1PPS0                      2662
#define CCP1PPS1                      2663
#define CCP1PPS2                      2664
#define CCP1PPS3                      2665
#define CCP1PPS4                      2666
#define CCP2PPS                       2667
#define CCP2PPS0                      2668
#define CCP2PPS1                      2669
#define CCP2PPS2                      2670
#define CCP2PPS3                      2671
#define CCP2PPS4                      2672
#define ATINPPS                       2673
#define ATINPPS0                      2674
#define ATINPPS1                      2675
#define ATINPPS2                      2676
#define ATINPPS3                      2677
#define ATINPPS4                      2678
#define CWGINPPS                      2679
#define CWGINPPS0                     2680
#define CWGINPPS1                     2681
#define CWGINPPS2                     2682
#define CWGINPPS3                     2683
#define CWGINPPS4                     2684
#define T2PPS                         2685
#define T2PPS0                        2686
#define T2PPS1                        2687
#define T2PPS2                        2688
#define T2PPS3                        2689
#define T2PPS4                        2690
#define T3CKIPPS                      2691
#define T3CKIPPS0                     2692
#define T3CKIPPS1                     2693
#define T3CKIPPS2                     2694
#define T3CKIPPS3                     2695
#define T3CKIPPS4                     2696
#define T3GPPS                        2697
#define T3GPPS0                       2698
#define T3GPPS1                       2699
#define T3GPPS2                       2700
#define T3GPPS3                       2701
#define T3GPPS4                       2702
#define T4PPS                         2703
#define T4PPS0                        2704
#define T4PPS1                        2705
#define T4PPS2                        2706
#define T4PPS3                        2707
#define T4PPS4                        2708
#define T5CKIPPS                      2709
#define T5CKIPPS0                     2710
#define T5CKIPPS1                     2711
#define T5CKIPPS2                     2712
#define T5CKIPPS3                     2713
#define T5CKIPPS4                     2714
#define T5GPPS                        2715
#define T5GPPS0                       2716
#define T5GPPS1                       2717
#define T5GPPS2                       2718
#define T5GPPS3                       2719
#define T5GPPS4                       2720
#define T6PPS                         2721
#define T6PPS0                        2722
#define T6PPS1                        2723
#define T6PPS2                        2724
#define T6PPS3                        2725
#define T6PPS4                        2726
#define ATCC1PPS                      2727
#define ATCC1PPS0                     2728
#define ATCC1PPS1                     2729
#define ATCC1PPS2                     2730
#define ATCC1PPS3                     2731
#define ATCC1PPS4                     2732
#define SSPCLKPPS                     2733
#define SSPCLKPPS0                    2734
#define SSPCLKPPS1                    2735
#define SSPCLKPPS2                    2736
#define SSPCLKPPS3                    2737
#define SSPCLKPPS4                    2738
#define SSPDATPPS                     2739
#define SSPDATPPS0                    2740
#define SSPDATPPS1                    2741
#define SSPDATPPS2                    2742
#define SSPDATPPS3                    2743
#define SSPDATPPS4                    2744
#define SSPSSPPS                      2745
#define SSPSSPPS0                     2746
#define SSPSSPPS1                     2747
#define SSPSSPPS2                     2748
#define SSPSSPPS3                     2749
#define SSPSSPPS4                     2750
#define ATCC2PPS                      2751
#define ATCC2PPS0                     2752
#define ATCC2PPS1                     2753
#define ATCC2PPS2                     2754
#define ATCC2PPS3                     2755
#define ATCC2PPS4                     2756
#define RXPPS                         2757
#define RXPPS0                        2758
#define RXPPS1                        2759
#define RXPPS2                        2760
#define RXPPS3                        2761
#define RXPPS4                        2762
#define CKPPS                         2763
#define CKPPS0                        2764
