tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1615_tdd.h
#define CKPPS1                        2765
#define CKPPS2                        2766
#define CKPPS3                        2767
#define CKPPS4                        2768
#define SMT1SIGPPS                    2769
#define SMT1SIGPPS0                   2770
#define SMT1SIGPPS1                   2771
#define SMT1SIGPPS2                   2772
#define SMT1SIGPPS3                   2773
#define SMT1SIGPPS4                   2774
#define SMT1WINPPS                    2775
#define SMTWINPPS0                    2776
#define SMTWINPPS1                    2777
#define SMTWINPPS2                    2778
#define SMTWINPPS3                    2779
#define SMTWINPPS4                    2780
#define CLCIN0PPS                     2781
#define CLCIN0PPS0                    2782
#define CLCIN0PPS1                    2783
#define CLCIN0PPS2                    2784
#define CLCIN0PPS3                    2785
#define CLCIN0PPS4                    2786
#define CLCIN1PPS                     2787
#define CLCIN1PPS0                    2788
#define CLCIN1PPS1                    2789
#define CLCIN1PPS2                    2790
#define CLCIN1PPS3                    2791
#define CLCIN1PPS4                    2792
#define CLCIN2PPS                     2793
#define CLCIN2PPS0                    2794
#define CLCIN2PPS1                    2795
#define CLCIN2PPS2                    2796
#define CLCIN2PPS3                    2797
#define CLCIN2PPS4                    2798
#define CLCIN3PPS                     2799
#define CLCIN3PPS0                    2800
#define CLCIN3PPS1                    2801
#define CLCIN3PPS2                    2802
#define CLCIN3PPS3                    2803
#define CLCIN3PPS4                    2804
#define SMT2SIGPPS                    2805
#define SMT2SIGPPS0                   2806
#define SMT2SIGPPS1                   2807
#define SMT2SIGPPS2                   2808
#define SMT2SIGPPS3                   2809
#define SMT2SIGPPS4                   2810
#define SMT2WINPPS                    2811
#define SMT2WINPPS0                   2812
#define SMT2WINPPS1                   2813
#define SMT2WINPPS2                   2814
#define SMT2WINPPS3                   2815
#define SMT2WINPPS4                   2816
#define ATCC3PPS                      2817
#define ATCC3PPS0                     2818
#define ATCC3PPS1                     2819
#define ATCC3PPS2                     2820
#define ATCC3PPS3                     2821
#define ATCC3PPS4                     2822
#define RA0PPS                        2823
#define RA0PPS0                       2824
#define RA0PPS1                       2825
#define RA0PPS2                       2826
#define RA0PPS3                       2827
#define RA0PPS4                       2828
#define RA1PPS                        2829
#define RA1PPS0                       2830
#define RA1PPS1                       2831
#define RA1PPS2                       2832
#define RA1PPS3                       2833
#define RA1PPS4                       2834
#define RA2PPS                        2835
#define RA2PPS0                       2836
#define RA2PPS1                       2837
#define RA2PPS2                       2838
#define RA2PPS3                       2839
#define RA2PPS4                       2840
#define RA4PPS                        2841
#define RA4PPS0                       2842
#define RA4PPS1                       2843
#define RA4PPS2                       2844
#define RA4PPS3                       2845
#define RA4PPS4                       2846
#define RA5PPS                        2847
#define RA5PPS0                       2848
#define RA5PPS1                       2849
#define RA5PPS2                       2850
#define RA5PPS3                       2851
#define RA5PPS4                       2852
#define RC0PPS                        2853
#define RC0PPS0                       2854
#define RC0PPS1                       2855
#define RC0PPS2                       2856
#define RC0PPS3                       2857
#define RC0PPS4                       2858
#define RC1PPS                        2859
#define RC1PPS0                       2860
#define RC1PPS1                       2861
#define RC1PPS2                       2862
#define RC1PPS3                       2863
#define RC1PPS4                       2864
#define RC2PPS                        2865
#define RC2PPS0                       2866
#define RC2PPS1                       2867
#define RC2PPS2                       2868
#define RC2PPS3                       2869
#define RC2PPS4                       2870
#define RC3PPS                        2871
#define RC3PPS0                       2872
#define RC3PPS1                       2873
#define RC3PPS2                       2874
#define RC3PPS3                       2875
#define RC3PPS4                       2876
#define RC4PPS                        2877
#define RC4PPS0                       2878
#define RC4PPS1                       2879
#define RC4PPS2                       2880
#define RC4PPS3                       2881
#define RC4PPS4                       2882
#define RC5PPS                        2883
#define RC5PPS0                       2884
#define RC5PPS1                       2885
#define RC5PPS2                       2886
#define RC5PPS3                       2887
#define RC5PPS4                       2888
#define CLCDATA                       2889
#define MLC1OUT                       2890
#define MLC2OUT                       2891
#define MLC3OUT                       2892
#define MLC4OUT                       2893
#define CLC1CON                       2894
#define CLC1CON_MODE                  2895
#define LC1MODE0                      2896
#define LC1MODE                       2897
#define CLC1CON_MODE0                 2898
#define LC1MODE1                      2899
#define CLC1CON_MODE1                 2900
#define LC1MODE2                      2901
#define CLC1CON_MODE2                 2902
#define LC1INTN                       2903
#define CLC1CON_INTN                  2904
#define LC1INTP                       2905
#define CLC1CON_INTP                  2906
#define LC1OUT                        2907
#define CLC1CON_OUT                   2908
#define LC1EN                         2909
#define CLC1CON_EN                    2910
#define CLC1POL                       2911
#define LC1G1POL                      2912
#define CLC1POL_G1POL                 2913
#define CLC1POL_G2POL                 2914
#define LC1G2POL                      2915
#define LC1G3POL                      2916
#define CLC1POL_G3POL                 2917
#define LC1G4POL                      2918
#define CLC1POL_G4POL                 2919
#define CLC1POL_POL                   2920
#define LC1POL                        2921
#define CLC1SEL0                      2922
#define CLC1SEL0_D1S0                 2923
#define LC1D1S0                       2924
#define CLC1SEL0_D1S                  2925
#define LC1D1S                        2926
#define CLC1SEL0_D1S1                 2927
#define LC1D1S1                       2928
#define CLC1SEL0_D1S2                 2929
#define LC1D1S2                       2930
#define LC1D1S3                       2931
#define CLC1SEL0_D1S3                 2932
#define CLC1SEL0_D1S4                 2933
#define LC1D1S4                       2934
#define CLC1SEL0_D1S5                 2935
#define LC1D1S5                       2936
#define CLC1SEL1                      2937
#define CLC1SEL1_D2S0                 2938
#define CLC1SEL1_D2S                  2939
#define LC1D2S                        2940
#define LC1D2S0                       2941
#define CLC1SEL1_D2S1                 2942
#define LC1D2S1                       2943
#define CLC1SEL1_D2S2                 2944
#define LC1D2S2                       2945
#define LC1D2S3                       2946
#define CLC1SEL1_D2S3                 2947
#define LC1D2S4                       2948
#define CLC1SEL1_D2S4                 2949
#define LC1D2S5                       2950
#define CLC1SEL1_D2S5                 2951
#define CLC1SEL2                      2952
#define LC1D3S0                       2953
#define CLC1SEL2_D3S                  2954
#define LC1D3S                        2955
#define CLC1SEL2_D3S0                 2956
#define LC1D3S1                       2957
#define CLC1SEL2_D3S1                 2958
#define LC1D3S2                       2959
#define CLC1SEL2_D3S2                 2960
#define LC1D3S3                       2961
#define CLC1SEL2_D3S3                 2962
#define LC1D3S4                       2963
#define CLC1SEL2_D3S4                 2964
#define LC1D3S5                       2965
#define CLC1SEL2_D3S5                 2966
#define CLC1SEL3                      2967
#define CLC1SEL3_D4S                  2968
#define LC1D4S                        2969
#define LC1D4S0                       2970
#define CLC1SEL3_D4S0                 2971
#define CLC1SEL3_D4S1                 2972
#define LC1D4S1                       2973
#define LC1D4S2                       2974
#define CLC1SEL3_D4S2                 2975
#define LC1D4S3                       2976
#define CLC1SEL3_D4S3                 2977
#define LC1D4S4                       2978
#define CLC1SEL3_D4S4                 2979
#define LC1D4S5                       2980
#define CLC1SEL3_D4S5                 2981
#define CLC1GLS0                      2982
#define CLC1GLS0_D1N                  2983
#define LC1G1D1N                      2984
#define CLC1GLS0_D1T                  2985
#define LC1G1D1T                      2986
#define LC1G1D2N                      2987
#define CLC1GLS0_D2N                  2988
#define LC1G1D2T                      2989
#define CLC1GLS0_D2T                  2990
#define CLC1GLS0_D3N                  2991
#define LC1G1D3N                      2992
#define CLC1GLS0_D3T                  2993
#define LC1G1D3T                      2994
#define CLC1GLS0_D4N                  2995
#define LC1G1D4N                      2996
#define CLC1GLS0_D4T                  2997
#define LC1G1D4T                      2998
#define CLC1GLS1                      2999
#define CLC1GLS1_D1N                  3000
#define LC1G2D1N                      3001
#define LC1G2D1T                      3002
#define CLC1GLS1_D1T                  3003
#define CLC1GLS1_D2N                  3004
#define LC1G2D2N                      3005
#define LC1G2D2T                      3006
#define CLC1GLS1_D2T                  3007
#define CLC1GLS1_D3N                  3008
#define LC1G2D3N                      3009
#define LC1G2D3T                      3010
#define CLC1GLS1_D3T                  3011
#define CLC1GLS1_D4N                  3012
#define LC1G2D4N                      3013
#define LC1G2D4T                      3014
#define CLC1GLS1_D4T                  3015
#define CLC1GLS2                      3016
#define CLC1GLS2_D1N                  3017
#define LC1G3D1N                      3018
#define LC1G3D1T                      3019
#define CLC1GLS2_D1T                  3020
#define LC1G3D2N                      3021
#define CLC1GLS2_D2N                  3022
#define LC1G3D2T                      3023
#define CLC1GLS2_D2T                  3024
#define CLC1GLS2_D3N                  3025
#define LC1G3D3N                      3026
#define LC1G3D3T                      3027
#define CLC1GLS2_D3T                  3028
#define LC1G3D4N                      3029
#define CLC1GLS2_D4N                  3030
#define LC1G3D4T                      3031
#define CLC1GLS2_D4T                  3032
#define CLC1GLS3                      3033
#define LC1G4D1N                      3034
#define CLC1GLS3_G4D1N                3035
#define LC1G4D1T                      3036
#define CLC1GLS3_G4D1T                3037
#define CLC1GLS3_G4D2N                3038
#define LC1G4D2N                      3039
#define CLC1GLS3_G4D2T                3040
#define LC1G4D2T                      3041
#define LC1G4D3N                      3042
#define CLC1GLS3_G4D3N                3043
#define LC1G4D3T                      3044
#define CLC1GLS3_G4D3T                3045
#define CLC1GLS3_G4D4N                3046
#define LC1G4D4N                      3047
#define CLC1GLS3_G4D4T                3048
#define LC1G4D4T                      3049
#define CLC2CON                       3050
#define LC2MODE0                      3051
#define CLC2CON_MODE                  3052
#define LC2MODE                       3053
#define CLC2CON_MODE0                 3054
#define LC2MODE1                      3055
#define CLC2CON_MODE1                 3056
#define LC2MODE2                      3057
#define CLC2CON_MODE2                 3058
#define LC2INTN                       3059
#define CLC2CON_INTN                  3060
#define LC2INTP                       3061
#define CLC2CON_INTP                  3062
#define CLC2CON_OUT                   3063
#define LC2OUT                        3064
#define CLC2CON_EN                    3065
#define LC2EN                         3066
#define CLC2POL                       3067
#define LC2G1POL                      3068
#define CLC2POL_G1POL                 3069
#define LC2G2POL                      3070
#define CLC2POL_G2POL                 3071
#define LC2G3POL                      3072
#define CLC2POL_G3POL                 3073
#define LC2G4POL                      3074
#define CLC2POL_G4POL                 3075
#define CLC2POL_POL                   3076
#define LC2POL                        3077
#define CLC2SEL0                      3078
#define CLC2SEL0_D1S                  3079
#define LC2D1S0                       3080
#define CLC2SEL0_D1S0                 3081
#define LC2D1S                        3082
#define LC2D1S1                       3083
#define CLC2SEL0_D1S1                 3084
#define LC2D1S2                       3085
#define CLC2SEL0_D1S2                 3086
#define CLC2SEL0_D1S3                 3087
#define LC2D1S3                       3088
#define LC2D1S4                       3089
#define CLC2SEL0_D1S4                 3090
#define LC2D1S5                       3091
#define CLC2SEL0_D1S5                 3092
#define CLC2SEL1                      3093
#define LC2D2S0                       3094
#define CLC2SEL1_D2S0                 3095
#define LC2D2S                        3096
#define CLC2SEL1_D2S                  3097
#define LC2D2S1                       3098
#define CLC2SEL1_D2S1                 3099
#define LC2D2S2                       3100
#define CLC2SEL1_D2S2                 3101
#define LC2D2S3                       3102
#define CLC2SEL1_D2S3                 3103
#define LC2D2S4                       3104
#define CLC2SEL1_D2S4                 3105
#define LC2D2S5                       3106
#define CLC2SEL1_D2S5                 3107
#define CLC2SEL2                      3108
#define CLC2SEL2_D3S                  3109
#define LC2D3S0                       3110
#define CLC2SEL2_D3S0                 3111
#define LC2D3S                        3112
#define CLC2SEL2_D3S1                 3113
#define LC2D3S1                       3114
#define LC2D3S2                       3115
#define CLC2SEL2_D3S2                 3116
#define LC2D3S3                       3117
#define CLC2SEL2_D3S3                 3118
#define LC2D3S4                       3119
#define CLC2SEL2_D3S4                 3120
#define LC2D3S5                       3121
#define CLC2SEL2_D3S5                 3122
#define CLC2SEL3                      3123
#define LC2D4S0                       3124
#define CLC2SEL3_D4S                  3125
#define CLC2SEL3_D4S0                 3126
#define LC2D4S                        3127
#define LC2D4S1                       3128
#define CLC2SEL3_D4S1                 3129
#define LC2D4S2                       3130
#define CLC2SEL3_D4S2                 3131
#define CLC2SEL3_D4S3                 3132
#define LC2D4S3                       3133
#define LC2D4S4                       3134
#define CLC2SEL3_D4S4                 3135
#define LC2D4S5                       3136
#define CLC2SEL3_D4S5                 3137
#define CLC2GLS0                      3138
#define LC2G1D1N                      3139
#define CLC2GLS0_D1N                  3140
#define CLC2GLS0_D1T                  3141
#define LC2G1D1T                      3142
#define LC2G1D2N                      3143
#define CLC2GLS0_D2N                  3144
#define CLC2GLS0_D2T                  3145
#define LC2G1D2T                      3146
#define LC2G1D3N                      3147
#define CLC2GLS0_D3N                  3148
#define CLC2GLS0_D3T                  3149
#define LC2G1D3T                      3150
#define LC2G1D4N                      3151
#define CLC2GLS0_D4N                  3152
#define CLC2GLS0_D4T                  3153
#define LC2G1D4T                      3154
#define CLC2GLS1                      3155
#define CLC2GLS1_D1N                  3156
#define LC2G2D1N                      3157
#define CLC2GLS1_D1T                  3158
#define LC2G2D1T                      3159
#define CLC2GLS1_D2N                  3160
#define LC2G2D2N                      3161
#define CLC2GLS1_D2T                  3162
#define LC2G2D2T                      3163
#define LC2G2D3N                      3164
#define CLC2GLS1_D3N                  3165
#define LC2G2D3T                      3166
#define CLC2GLS1_D3T                  3167
#define LC2G2D4N                      3168
#define CLC2GLS1_D4N                  3169
#define LC2G2D4T                      3170
#define CLC2GLS1_D4T                  3171
#define CLC2GLS2                      3172
#define LC2G3D1N                      3173
#define CLC2GLS2_D1N                  3174
#define CLC2GLS2_D1T                  3175
#define LC2G3D1T                      3176
#define CLC2GLS2_D2N                  3177
#define LC2G3D2N                      3178
#define LC2G3D2T                      3179
#define CLC2GLS2_D2T                  3180
#define CLC2GLS2_D3N                  3181
#define LC2G3D3N                      3182
#define CLC2GLS2_D3T                  3183
#define LC2G3D3T                      3184
#define CLC2GLS2_D4N                  3185
#define LC2G3D4N                      3186
#define LC2G3D4T                      3187
#define CLC2GLS2_D4T                  3188
#define CLC2GLS3                      3189
#define LC2G4D1N                      3190
#define CLC2GLS3_G4D1N                3191
#define CLC2GLS3_G4D1T                3192
#define LC2G4D1T                      3193
#define CLC2GLS3_G4D2N                3194
#define LC2G4D2N                      3195
#define LC2G4D2T                      3196
#define CLC2GLS3_G4D2T                3197
#define CLC2GLS3_G4D3N                3198
#define LC2G4D3N                      3199
#define CLC2GLS3_G4D3T                3200
#define LC2G4D3T                      3201
#define LC2G4D4N                      3202
#define CLC2GLS3_G4D4N                3203
#define CLC2GLS3_G4D4T                3204
#define LC2G4D4T                      3205
#define CLC3CON                       3206
#define LC3MODE0                      3207
#define CLC3CON_MODE0                 3208
#define CLC3CON_MODE                  3209
#define LC3MODE                       3210
#define LC3MODE1                      3211
#define CLC3CON_MODE1                 3212
#define LC3MODE2                      3213
#define CLC3CON_MODE2                 3214
#define LC3INTN                       3215
#define CLC3CON_INTN                  3216
#define CLC3CON_INTP                  3217
#define LC3INTP                       3218
#define CLC3CON_OUT                   3219
#define LC3OUT                        3220
#define LC3EN                         3221
#define CLC3CON_EN                    3222
#define CLC3POL                       3223
#define LC3G1POL                      3224
#define CLC3POL_G1POL                 3225
#define LC3G2POL                      3226
#define CLC3POL_G2POL                 3227
#define CLC3POL_G3POL                 3228
#define LC3G3POL                      3229
#define LC3G4POL                      3230
#define CLC3POL_G4POL                 3231
#define LC3POL                        3232
#define CLC3POL_POL                   3233
#define CLC3SEL0                      3234
#define CLC3SEL0_D1S0                 3235
#define LC3D1S0                       3236
#define CLC3SEL0_D1S                  3237
#define LC3D1S                        3238
#define LC3D1S1                       3239
#define CLC3SEL0_D1S1                 3240
#define LC3D1S2                       3241
#define CLC3SEL0_D1S2                 3242
#define LC3D1S3                       3243
#define CLC3SEL0_D1S3                 3244
#define LC3D1S4                       3245
#define CLC3SEL0_D1S4                 3246
#define LC3D1S5                       3247
#define CLC3SEL0_D1S5                 3248
#define CLC3SEL1                      3249
#define CLC3SEL1_D2S                  3250
#define CLC3SEL1_D2S0                 3251
#define LC3D2S                        3252
#define LC3D2S0                       3253
#define CLC3SEL1_D2S1                 3254
#define LC3D2S1                       3255
#define CLC3SEL1_D2S2                 3256
#define LC3D2S2                       3257
#define CLC3SEL1_D2S3                 3258
#define LC3D2S3                       3259
#define CLC3SEL1_D2S4                 3260
#define LC3D2S4                       3261
#define CLC3SEL1_D2S5                 3262
#define LC3D2S5                       3263
#define CLC3SEL2                      3264
#define LC3D3S                        3265
#define CLC3SEL2_D3S                  3266
#define LC3D3S0                       3267
#define CLC3SEL2_D3S0                 3268
#define LC3D3S1                       3269
#define CLC3SEL2_D3S1                 3270
#define LC3D3S2                       3271
#define CLC3SEL2_D3S2                 3272
#define LC3D3S3                       3273
#define CLC3SEL2_D3S3                 3274
#define CLC3SEL2_D3S4                 3275
#define LC3D3S4                       3276
#define CLC3SEL2_D3S5                 3277
#define LC3D3S5                       3278
#define CLC3SEL3                      3279
#define CLC3SEL3_D4S0                 3280
#define LC3D4S0                       3281
#define CLC3SEL3_D4S                  3282
#define LC3D4S                        3283
#define LC3D4S1                       3284
#define CLC3SEL3_D4S1                 3285
#define LC3D4S2                       3286
#define CLC3SEL3_D4S2                 3287
#define LC3D4S3                       3288
#define CLC3SEL3_D4S3                 3289
#define LC3D4S4                       3290
#define CLC3SEL3_D4S4                 3291
#define LC3D4S5                       3292
#define CLC3SEL3_D4S5                 3293
#define CLC3GLS0                      3294
#define CLC3GLS0_D1N                  3295
#define LC3G1D1N                      3296
#define LC3G1D1T                      3297
#define CLC3GLS0_D1T                  3298
#define LC3G1D2N                      3299
#define CLC3GLS0_D2N                  3300
#define CLC3GLS0_D2T                  3301
#define LC3G1D2T                      3302
#define CLC3GLS0_D3N                  3303
#define LC3G1D3N                      3304
#define LC3G1D3T                      3305
#define CLC3GLS0_D3T                  3306
#define CLC3GLS0_D4N                  3307
#define LC3G1D4N                      3308
#define CLC3GLS0_D4T                  3309
#define LC3G1D4T                      3310
#define CLC3GLS1                      3311
#define LC3G2D1N                      3312
#define CLC3GLS1_D1N                  3313
#define CLC3GLS1_D1T                  3314
#define LC3G2D1T                      3315
#define LC3G2D2N                      3316
#define CLC3GLS1_D2N                  3317
#define LC3G2D2T                      3318
#define CLC3GLS1_D2T                  3319
#define LC3G2D3N                      3320
#define CLC3GLS1_D3N                  3321
#define CLC3GLS1_D3T                  3322
