tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1615_tdd.h
#define LC3G2D3T                      3323
#define LC3G2D4N                      3324
#define CLC3GLS1_D4N                  3325
#define LC3G2D4T                      3326
#define CLC3GLS1_D4T                  3327
#define CLC3GLS2                      3328
#define LC3G3D1N                      3329
#define CLC3GLS2_D1N                  3330
#define LC3G3D1T                      3331
#define CLC3GLS2_D1T                  3332
#define CLC3GLS2_D2N                  3333
#define LC3G3D2N                      3334
#define CLC3GLS2_D2T                  3335
#define LC3G3D2T                      3336
#define CLC3GLS2_D3N                  3337
#define LC3G3D3N                      3338
#define LC3G3D3T                      3339
#define CLC3GLS2_D3T                  3340
#define CLC3GLS2_D4N                  3341
#define LC3G3D4N                      3342
#define CLC3GLS2_D4T                  3343
#define LC3G3D4T                      3344
#define CLC3GLS3                      3345
#define LC3G4D1N                      3346
#define CLC3GLS3_G4D1N                3347
#define LC3G4D1T                      3348
#define CLC3GLS3_G4D1T                3349
#define LC3G4D2N                      3350
#define CLC3GLS3_G4D2N                3351
#define CLC3GLS3_G4D2T                3352
#define LC3G4D2T                      3353
#define LC3G4D3N                      3354
#define CLC3GLS3_G4D3N                3355
#define CLC3GLS3_G4D3T                3356
#define LC3G4D3T                      3357
#define LC3G4D4N                      3358
#define CLC3GLS3_G4D4N                3359
#define LC3G4D4T                      3360
#define CLC3GLS3_G4D4T                3361
#define CLC4CON                       3362
#define LC4MODE                       3363
#define CLC4CON_MODE                  3364
#define LC4MODE0                      3365
#define CLC4CON_MODE0                 3366
#define LC4MODE1                      3367
#define CLC4CON_MODE1                 3368
#define LC4MODE2                      3369
#define CLC4CON_MODE2                 3370
#define LC4INTN                       3371
#define CLC4CON_INTN                  3372
#define CLC4CON_INTP                  3373
#define LC4INTP                       3374
#define CLC4CON_OUT                   3375
#define LC4OUT                        3376
#define CLC4CON_EN                    3377
#define LC4EN                         3378
#define CLC4POL                       3379
#define CLC4POL_G1POL                 3380
#define LC4G1POL                      3381
#define CLC4POL_G2POL                 3382
#define LC4G2POL                      3383
#define CLC4POL_G3POL                 3384
#define LC4G3POL                      3385
#define LC4G4POL                      3386
#define CLC4POL_G4POL                 3387
#define LC4POL                        3388
#define CLC4POL_POL                   3389
#define CLC4SEL0                      3390
#define CLC4SEL0_D1S0                 3391
#define LC4D1S0                       3392
#define CLC4SEL0_D1S                  3393
#define LC4D1S                        3394
#define CLC4SEL0_D1S1                 3395
#define LC4D1S1                       3396
#define CLC4SEL0_D1S2                 3397
#define LC4D1S2                       3398
#define CLC4SEL0_D1S3                 3399
#define LC4D1S3                       3400
#define CLC4SEL0_D1S4                 3401
#define LC4D1S4                       3402
#define CLC4SEL0_D1S5                 3403
#define LC4D1S5                       3404
#define CLC4SEL1                      3405
#define LC4D2S0                       3406
#define CLC4SEL1_D2S                  3407
#define CLC4SEL1_D2S0                 3408
#define LC4D2S                        3409
#define CLC4SEL1_D2S1                 3410
#define LC4D2S1                       3411
#define LC4D2S2                       3412
#define CLC4SEL1_D2S2                 3413
#define LC4D2S3                       3414
#define CLC4SEL1_D2S3                 3415
#define LC4D2S4                       3416
#define CLC4SEL1_D2S4                 3417
#define LC4D2S5                       3418
#define CLC4SEL1_D2S5                 3419
#define CLC4SEL2                      3420
#define LC4D3S                        3421
#define CLC4SEL2_D3S                  3422
#define CLC4SEL2_D3S0                 3423
#define LC4D3S0                       3424
#define LC4D3S1                       3425
#define CLC4SEL2_D3S1                 3426
#define CLC4SEL2_D3S2                 3427
#define LC4D3S2                       3428
#define CLC4SEL2_D3S3                 3429
#define LC4D3S3                       3430
#define CLC4SEL2_D3S4                 3431
#define LC4D3S4                       3432
#define CLC4SEL2_D3S5                 3433
#define LC4D3S5                       3434
#define CLC4SEL3                      3435
#define LC4D4S0                       3436
#define LC4D4S                        3437
#define CLC4SEL3_D4S0                 3438
#define CLC4SEL3_D4S                  3439
#define LC4D4S1                       3440
#define CLC4SEL3_D4S1                 3441
#define LC4D4S2                       3442
#define CLC4SEL3_D4S2                 3443
#define LC4D4S3                       3444
#define CLC4SEL3_D4S3                 3445
#define LC4D4S4                       3446
#define CLC4SEL3_D4S4                 3447
#define LC4D4S5                       3448
#define CLC4SEL3_D4S5                 3449
#define CLC4GLS0                      3450
#define CLC4GLS0_D1N                  3451
#define LC4G1D1N                      3452
#define CLC4GLS0_D1T                  3453
#define LC4G1D1T                      3454
#define CLC4GLS0_D2N                  3455
#define LC4G1D2N                      3456
#define CLC4GLS0_D2T                  3457
#define LC4G1D2T                      3458
#define CLC4GLS0_D3N                  3459
#define LC4G1D3N                      3460
#define CLC4GLS0_D3T                  3461
#define LC4G1D3T                      3462
#define CLC4GLS0_D4N                  3463
#define LC4G1D4N                      3464
#define CLC4GLS0_D4T                  3465
#define LC4G1D4T                      3466
#define CLC4GLS1                      3467
#define CLC4GLS1_D1N                  3468
#define LC4G2D1N                      3469
#define CLC4GLS1_D1T                  3470
#define LC4G2D1T                      3471
#define LC4G2D2N                      3472
#define CLC4GLS1_D2N                  3473
#define LC4G2D2T                      3474
#define CLC4GLS1_D2T                  3475
#define CLC4GLS1_D3N                  3476
#define LC4G2D3N                      3477
#define LC4G2D3T                      3478
#define CLC4GLS1_D3T                  3479
#define CLC4GLS1_D4N                  3480
#define LC4G2D4N                      3481
#define CLC4GLS1_D4T                  3482
#define LC4G2D4T                      3483
#define CLC4GLS2                      3484
#define CLC4GLS2_D1N                  3485
#define LC4G3D1N                      3486
#define CLC4GLS2_D1T                  3487
#define LC4G3D1T                      3488
#define LC4G3D2N                      3489
#define CLC4GLS2_D2N                  3490
#define LC4G3D2T                      3491
#define CLC4GLS2_D2T                  3492
#define CLC4GLS2_D3N                  3493
#define LC4G3D3N                      3494
#define CLC4GLS2_D3T                  3495
#define LC4G3D3T                      3496
#define LC4G3D4N                      3497
#define CLC4GLS2_D4N                  3498
#define LC4G3D4T                      3499
#define CLC4GLS2_D4T                  3500
#define CLC4GLS3                      3501
#define CLC4GLS3_G4D1N                3502
#define LC4G4D1N                      3503
#define LC4G4D1T                      3504
#define CLC4GLS3_G4D1T                3505
#define LC4G4D2N                      3506
#define CLC4GLS3_G4D2N                3507
#define LC4G4D2T                      3508
#define CLC4GLS3_G4D2T                3509
#define CLC4GLS3_G4D3N                3510
#define LC4G4D3N                      3511
#define CLC4GLS3_G4D3T                3512
#define LC4G4D3T                      3513
#define LC4G4D4N                      3514
#define CLC4GLS3_G4D4N                3515
#define LC4G4D4T                      3516
#define CLC4GLS3_G4D4T                3517
#define STATUS_SHAD                   3518
#define C_SHAD                        3519
#define DC_SHAD                       3520
#define Z_SHAD                        3521
#define WREG_SHAD                     3522
#define BSR_SHAD                      3523
#define PCLATH_SHAD                   3524
#define FSR0L_SHAD                    3525
#define FSR0H_SHAD                    3526
#define FSR1L_SHAD                    3527
#define FSR1H_SHAD                    3528
#define STKPTR                        3529
#define TOSL                          3530
#define TOSH                          3531

#endif // _PIC16F1615_H_
